MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_xspi.c
  * @brief   XSPI HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functions of the Extended Serial Peripheral Interface (XSPI) peripheral:
  *           + Initialization and deinitialization functions
  *           + I/O operation functions
  *           + Peripheral control functions
  *           + Peripheral state functions.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @addtogroup XSPI
  * @{
  */
/** @defgroup XSPI_Introduction XSPI Introduction
  * @{

  - The **XSPI** hardware abstraction layer provides a set of APIs to interface with the STM32 XSPI (Extended Serial
    Peripheral Interface) peripheral.

  - It simplifies the configuration, initialization, and management of **XSPI** communication.
    Memory configuration and data transfer can be performed in different modes:
    - Indirect access mode: polling, interrupt, DMA for configuration and data transfer.
    - Direct access mode: memory mapped for data transfer only.

  - This abstraction layer ensures portability and ease of use across different STM32 series.

  */
/**
  * @}
  */

/** @defgroup XSPI_How_To_Use XSPI How To Use
  * @{

An explanation of XSPI overall usage:
- XSPI is the abbreviation of Expanded Serial Peripheral Interface. It is an interface that supports most external
  serial memories such as serial PSRAMs, serial NAND and serial NOR flash memories, HyperRAM and HyperFlash memories,
  with different functional modes.

This file provides firmware functions to manage the following functions of the XSPI peripheral:

- Initialization and deinitialization functions
- Configuration functions
- Command and I/O operation functions
- IRQHandler, link DMA, and callback functions
- Status functions
- Delay Block functions
- High-speed interface and calibration functions
- Interrupt functions

# How to use the XSPI HAL module driver

## Initialization and deinitialization functions:

- Declare a hal_xspi_handle_t handle structure, for example: hal_xspi_handle_t hxspi
- Use HAL_XSPI_Init() function to initialize the XSPI handle and associate the physical instance
- Use HAL_XSPI_DeInit() function to abort any ongoing operation then reset the state

## Configuration functions

- Use HAL_XSPI_SetConfig() function to configure the Regular/Hyperbus parameters of the XSPI peripheral

- Use HAL_XSPI_GetConfig() function to retrieve the current configuration for the XSPI instance


- Once a global configuration is applied (using HAL_XSPI_SetConfig()), optionally use the following unitary functions to
  update the different parameters individually:

  - HAL_XSPI_SetFifoThreshold()          Configure the FIFO threshold according to the user parameters.
  - HAL_XSPI_GetFifoThreshold()          Retrieve the FIFO threshold configuration.
  - HAL_XSPI_SetPrescaler()              Configure the prescaler according to the user parameters.
  - HAL_XSPI_GetPrescaler()              Retrieve the prescaler configuration.
  - HAL_XSPI_SetMemorySize()             Configure the XSPI memory size according to the user parameters.
  - HAL_XSPI_GetMemorySize()             Retrieve the XSPI memory size configuration.
  - HAL_XSPI_SetMemoryType()             Configure the XSPI memory type according to the user parameters.
  - HAL_XSPI_GetMemoryType()             Retrieve the XSPI memory type configuration.
  - HAL_XSPI_SetMemorySelection()        Configure the nCS used for memory selection.
  - HAL_XSPI_GetMemorySelection()        Retrieve the nCS used for memory selection.
  - HAL_XSPI_EnableFreeRunningClock()    Enable the free-running clock.
  - HAL_XSPI_DisableFreeRunningClock()   Disable the free-running clock.
  - HAL_XSPI_IsEnabledFreeRunningClock() Check whether the free-running clock is enabled.
  - HAL_XSPI_EnablePrefetchData()        Enable automatic prefetch in the external memory (reset value).
  - HAL_XSPI_DisablePrefetchData()       Disable automatic prefetch in the external memory.
  - HAL_XSPI_IsEnabledPrefetchData()     Check the state of automatic prefetch in the external memory.

## Command and I/O operation functions

- In Regular mode, use HAL_XSPI_SendRegularCmd()
  or
  HAL_XSPI_SendRegularCmd_IT() function to configure the command sequence.

- In Hyperbus mode, use HAL_XSPI_SendHyperbusCmd() function to configure the command sequence.

- If no data is required for the command (only for Regular Command mode, not for Hyperbus mode), it is sent directly to
  the memory:

  - In polling mode, the function returns when the command is complete.
  - In interrupt mode, the function starts the process and returns, the process continues in the background
    (based on the various interrupts). The HAL_XSPI_CmdCpltCallback() is called when the process is complete.

- For the indirect write mode, use HAL_XSPI_Transmit(), HAL_XSPI_Transmit_DMA(), HAL_XSPI_Transmit_DMA_Opt()
  or HAL_XSPI_Transmit_IT() after the command configuration:

  - In polling mode, the function returns when the transfer is complete.
  - In interrupt mode, the function starts the process and returns, the process continues in the background
    (based on the various interrupts). The HAL_XSPI_TxCpltCallback() is called when the process is complete.
  - In DMA mode:
      - HAL_XSPI_TxHalfCpltCallback() is called at the half transfer and
        HAL_XSPI_TxCpltCallback() is called when the transfer is complete.
      - The half transfer is filtered with HAL_XSPI_Transmit_DMA_Opt() and
        HAL_XSPI_TxCpltCallback() is called when the transfer is complete.

- For the indirect read mode, use HAL_XSPI_Receive(), HAL_XSPI_Receive_DMA(), HAL_XSPI_Receive_DMA_Opt()
  or HAL_XSPI_Receive_IT() after the command configuration:

