MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  - In polling mode, the function returns when the receive is complete.
  - In interrupt mode, the function starts the process and returns, the process continues in the background
    (based on the various interrupts). The HAL_XSPI_RxCpltCallback() is called when the process is complete.
  - In DMA mode:
      - HAL_XSPI_RxHalfCpltCallback() is called at the half transfer and
        HAL_XSPI_RxCpltCallback() is called when the transfer is complete.
      - The half transfer is filtered with HAL_XSPI_Receive_DMA_Opt() and
        HAL_XSPI_RxCpltCallback() is called when the transfer is complete.

- Use HAL_XSPI_ExecRegularAutoPoll() or HAL_XSPI_ExecRegularAutoPoll_IT() function to configure
  the auto-polling functional mode:

  - In polling mode, the function returns when the status match is reached. The automatic stop is
    activated to avoid an infinite loop.
  - In interrupt mode, HAL_XSPI_StatusMatchCallback() is called each time the status match is reached.

- Use HAL_XSPI_Abort()
  or
  HAL_XSPI_Abort_IT() function to abort any ongoing operation and to flush the FIFO:

  - In polling mode, the function returns when the transfer-complete bit is set and the busy bit is cleared.
  - In interrupt mode, the function starts the process and returns, the process continues in the background
    (based on the various interrupts). The HAL_XSPI_AbortCpltCallback() is called when the process is complete.

- Use HAL_XSPI_StartMemoryMappedMode() function to start the memory-mapped functional mode.

- Use HAL_XSPI_StopMemoryMappedMode() function to stop the memory-mapped functional mode.

## XSPI IRQHandler, link DMA, and callback functions

- XSPI IRQHandler

  - Use HAL_XSPI_IRQHandler() function called under XSPI_IRQHandler interrupt subroutine to handle any XSPI interrupt.

- Link DMA

  - Use HAL_XSPI_SetTxDMA() function to link/store Tx HAL DMA handle into the HAL XSPI handle.
  - Use HAL_XSPI_SetRxDMA() function to link/store Rx HAL DMA handle into the HAL XSPI handle.

- Callback functions

  - Call the function HAL_XSPI_RegisterErrorCallback() to register the XSPI error callback to be used instead of
    the weak HAL_XSPI_ErrorCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterAbortCpltCallback() to register the XSPI abort-complete callback to be used
    instead of the weak HAL_XSPI_AbortCpltCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterFifoThresholdCallback() to register the XSPI FIFO Threshold callback to be
    used instead of the weak HAL_XSPI_FifoThresholdCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterStatusMatchCallback() to register the XSPI Status Match callback to be used
    instead of the weak HAL_XSPI_StatusMatchCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterTxCpltCallback() to register the XSPI Transfer-Complete callback to be used
    instead of the weak HAL_XSPI_TxCpltCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterTxHalfCpltCallback() to register the XSPI Half-Transfer complete callback to be
    used instead of the weak HAL_XSPI_TxHalfCpltCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterRxCpltCallback() to register the XSPI Receive-Complete callback to be used
    instead of the weak HAL_XSPI_RxCpltCallback() predefined callback.

  - Call the function HAL_XSPI_RegisterRxHalfCpltCallback() to register the XSPI Half-Receive complete callback to be
    used instead of the weak HAL_XSPI_RxHalfCpltCallback() predefined callback.

## State functions

- Use HAL_XSPI_GetState() function to get the current state of the HAL XSPI driver.

## Clock frequency of the XSPI peripheral

- Use HAL_XSPI_GetClockFreq() to retrieve the current clock frequency of the XSPI peripheral.

## XSPI Delay Block functions

- The delay block (DLYB) is used to generate an output clock that is dephased from the input clock.

  - Use HAL_XSPI_DLYB_SetConfigDelay() to set the delay configuration of the delay block peripheral.
  - Use HAL_XSPI_DLYB_GetConfigDelay() to get the delay output clock phase of the delay block peripheral.
  - Use HAL_XSPI_DLYB_CalculateMaxClockPhase() to calculate the maximum output clock phase of the
    delay block peripheral.
  - Use HAL_XSPI_DLYB_Enable() to enable the delay block peripheral.
  - Use HAL_XSPI_DLYB_Disable() to disable the delay block peripheral.
  - Use HAL_XSPI_DLYB_IsEnabled() to check if the delay block peripheral is enabled or not.


## Interrupt functions

- Use HAL_XSPI_EnableIT() function to enable the interrupts.

- Use HAL_XSPI_DisableIT() function to disable the interrupts.

- Use HAL_XSPI_IsEnabledIT() function to get the interrupt source.

- Use HAL_XSPI_IsActiveFlag() function to get flags.

- Use HAL_XSPI_ClearFlag() function to clear flags.
  */
/**
  * @}
  */

/** @defgroup XSPI_Configuration_Table XSPI Configuration Table
  * @{
## Configuration inside the XSPI driver

Config defines                  | Description     | Default value     | Note
------------------------------- | --------------- | ----------------- | ------------------------------------------------
PRODUCT                         | from IDE        |        NA         | The selected device (Ex: STM32C5XX)
USE_HAL_XSPI_MODULE             | from hal_conf.h |        1U         | Allows use of the HAL XSPI module
USE_ASSERT_DBG_PARAM            | from IDE        |        NA         | Allows use of the assert check parameters
USE_ASSERT_DBG_STATE            | from IDE        |        NA         | Allows use of the assert check states
USE_HAL_CHECK_PARAM             | from hal_conf.h |        0U         | Allows use of the run-time check parameters
USE_HAL_CHECK_PROCESS_STATE     | from hal_conf.h |        0U         | Allows load and store exclusive operations
USE_HAL_XSPI_DMA                | from hal_conf.h |        1U         | Allows use of DMA mode
USE_HAL_XSPI_HYPERBUS           | from hal_conf.h |        1U         | Allows use of the HYPERBUS protocol
USE_HAL_XSPI_REGISTER_CALLBACKS | from hal_conf.h |        0U         | Allows use of register callbacks
USE_HAL_XSPI_CLK_ENABLE_MODEL   | from hal_conf.h | HAL_CLK_ENABLE_NO | Allows use of the clock enable model
 */
/**
  * @}
  */
#if defined(XSPI1)

