MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
#if defined (USE_HAL_XSPI_MODULE) && (USE_HAL_XSPI_MODULE == 1U)

/** @defgroup XSPI_Private_Constants XSPI Private Constants
  * @{
  */
#define XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE 0x00000000U     /*!< Indirect write mode               */
#define XSPI_FUNCTIONAL_MODE_INDIRECT_READ  XSPI_CR_FMODE_0 /*!< Indirect read mode                */
#define XSPI_FUNCTIONAL_MODE_AUTO_POLLING   XSPI_CR_FMODE_1 /*!< Automatic polling mode            */
#define XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED  XSPI_CR_FMODE   /*!< Memory-mapped mode                */

#define XSPI_TIMEOUT_DEFAULT_VALUE          5U              /*!< XSPI timeout 5 seconds            */

#define XSPI_FIFO_FULL_SIZE                 64U             /*!< Data pass through 64-byte FIFO    */
#define XSPI_FIFO_MEDIUM_SIZE               32U             /*!< Data pass through 32-byte FIFO    */
#define XSPI_IO_SELECT_MSK                  XSPI_CR_MSEL    /*!< IO memory selection               */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup XSPI_Private_Macros XSPI Private Macros
  * @{
  */
/**
  * @brief Get the XSPI instance.
  */
#define XSPI_GET_INSTANCE(handle) ((XSPI_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @brief Get the XSPI instance within the Delay Block.
  */
#define XSPI_DLYB_GET_INSTANCE(instance) \
  ({                                     \
    STM32_UNUSED((instance));            \
    DLYB_XSPI1;                          \
  })

/**
  * @brief Check the FIFO threshold.
  */
#define IS_XSPI_FIFO_THRESHOLD_BYTE(instance, threshold) ((IS_XSPI_FULL_FIFO_SIZE(instance)) ?      \
                                                          (((threshold) >= 1U)                      \
                                                           && ((threshold) <= XSPI_FIFO_FULL_SIZE)) \
                                                          :(((threshold) >= 1U)                     \
                                                            && ((threshold) <= XSPI_FIFO_MEDIUM_SIZE)))

/**
  * @brief Check the Memory mode
  */
#define IS_XSPI_MEMORY_MODE(mode)                 (((mode) == HAL_XSPI_MEMORY_SINGLE) \
                                                   || ((mode) == HAL_XSPI_MEMORY_DUAL))

/**
  * @brief Check the Memory type
  */
#if defined(XSPI_DCR1_MTYP_2)
#define IS_XSPI_MEMORY_TYPE(type)                 (((type) == HAL_XSPI_MEMORY_TYPE_MICRON)          \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_MACRONIX)     \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_APMEM)        \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_MACRONIX_RAM) \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_HYPERBUS))
#else
#define IS_XSPI_MEMORY_TYPE(type)                 (((type) == HAL_XSPI_MEMORY_TYPE_MICRON)          \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_MACRONIX)     \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_APMEM)        \
                                                   || ((type) == HAL_XSPI_MEMORY_TYPE_MACRONIX_RAM))
#endif /* XSPI_DCR1_MTYP_2 */

/**
  * @brief Check the Memory size
  */
#define IS_XSPI_MEMORY_SIZE(size)                 (((size) == HAL_XSPI_MEMORY_SIZE_16BIT)      \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_32BIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_64BIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_128BIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_256BIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_512BIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_1KBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_2KBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_4KBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_8KBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_16KBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_32KBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_64KBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_128KBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_256KBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_512KBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_1MBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_2MBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_4MBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_8MBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_16MBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_32MBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_64MBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_128MBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_256MBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_512MBIT) \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_1GBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_2GBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_4GBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_8GBIT)   \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_16GBIT)  \
                                                   || ((size) == HAL_XSPI_MEMORY_SIZE_32GBIT))

/**
  * @brief Check the Chip select high time cycle
  */
#define IS_XSPI_CS_HIGH_TIME_CYCLE(time)          (((time) >= 1U) && ((time) <= 64U))


#if defined(XSPI_DCR2_WRAPSIZE)
/**
  * @brief Check the Wrap size
  */
#define IS_XSPI_WRAP_SIZE(size)                   (((size) == HAL_XSPI_WRAP_NOT_SUPPORTED) \
                                                   || ((size) == HAL_XSPI_WRAP_16BYTE)     \
                                                   || ((size) == HAL_XSPI_WRAP_32BYTE)     \
                                                   || ((size) == HAL_XSPI_WRAP_64BYTE)     \
                                                   || ((size) == HAL_XSPI_WRAP_128BYTE))
#endif /* XSPI_DCR2_WRAPSIZE */

/**
  * @brief Check the prescaler factor
  */
#define IS_XSPI_CLOCK_PRESCALER(prescaler)        ((prescaler) <= 255U)

/**
  * @brief Check the Sample shift
  */
#define IS_XSPI_SAMPLE_SHIFT(cycle)               (((cycle) == HAL_XSPI_SAMPLE_SHIFT_NONE) \
                                                   || ((cycle) == HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE))

/**
  * @brief Check the delay hold
  */
#define IS_XSPI_DELAY_HOLD(cycle)                 (((cycle) == HAL_XSPI_DELAY_HOLD_NONE) \
                                                   || ((cycle) == HAL_XSPI_DELAY_HOLD_QUARTCYCLE))

#if defined(XSPI_DCR3_CSBOUND)
/**
  * @brief Check the chip select boundary
  */
#define IS_XSPI_CS_BOUNDARY(size)                 (((size) == HAL_XSPI_CS_BOUNDARY_NONE)       \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_16BIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_32BIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_64BIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_128BIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_256BIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_512BIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_1KBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_2KBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_4KBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_8KBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_16KBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_32KBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_64KBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_128KBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_256KBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_512KBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_1MBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_2MBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_4MBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_8MBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_16MBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_32MBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_64MBIT)  \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_128MBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_256MBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_512MBIT) \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_1GBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_2GBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_4GBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_8GBIT)   \
                                                   || ((size) == HAL_XSPI_CS_BOUNDARY_16GBIT))
#endif /* XSPI_DCR3_CSBOUND */

/**
  * @brief Check the delay block bypass
  */
#define IS_XSPI_DLYB_BYPASS(dlyb)                 (((dlyb) == HAL_XSPI_DLYB_ON) \
                                                   || ((dlyb) == HAL_XSPI_DLYB_BYPASS))

/**
  * @brief Check the memory selection
  */
#define IS_XSPI_MEMORY_SELECTION(select)          (((select) == HAL_XSPI_MEMORY_SELECTION_NCS1) \
                                                   || ((select) == HAL_XSPI_MEMORY_SELECTION_NCS2))

/**
  * @brief Check the Operation type
  */
#if defined(XSPI_WIR_INSTRUCTION)
#define IS_XSPI_OPERATION_TYPE(type)              (((type) == HAL_XSPI_OPERATION_READ_CFG)     \
                                                   || ((type) == HAL_XSPI_OPERATION_WRITE_CFG) \
                                                   || ((type) == HAL_XSPI_OPERATION_WRAP_CFG))
#else
#define IS_XSPI_OPERATION_TYPE(type)              ((type) == HAL_XSPI_OPERATION_READ_CFG)
#endif /* XSPI_WIR_INSTRUCTION */

/**
  * @brief Check the I/O select
  */
#define IS_XSPI_IO_SELECT(instance, memsel)       (((memsel) == HAL_XSPI_IO_3_0)    \
                                                   || ((memsel) == HAL_XSPI_IO_7_4) \
                                                   || ((memsel) == HAL_XSPI_IO_7_0))

/**
  * @brief Check the Instruction mode
  */
#define IS_XSPI_INSTRUCTION_MODE(mode)            (((mode) == HAL_XSPI_INSTRUCTION_NONE)      \
                                                   || ((mode) == HAL_XSPI_INSTRUCTION_1LINE)  \
                                                   || ((mode) == HAL_XSPI_INSTRUCTION_2LINES) \
                                                   || ((mode) == HAL_XSPI_INSTRUCTION_4LINES) \
                                                   || ((mode) == HAL_XSPI_INSTRUCTION_8LINES))

/**
  * @brief Check the Instruction width
  */
#define IS_XSPI_INSTRUCTION_WIDTH(width)          (((width) == HAL_XSPI_INSTRUCTION_8BIT)     \
                                                   || ((width) == HAL_XSPI_INSTRUCTION_16BIT) \
                                                   || ((width) == HAL_XSPI_INSTRUCTION_24BIT) \
                                                   || ((width) == HAL_XSPI_INSTRUCTION_32BIT))

/**
  * @brief Check the Instruction dtr mode
  */
#define IS_XSPI_INSTRUCTION_DTR_MODE(mode)        (((mode) == HAL_XSPI_INSTRUCTION_DTR_DISABLED) \
                                                   || ((mode) == HAL_XSPI_INSTRUCTION_DTR_ENABLED))

/**
  * @brief Check the Address mode
  */
#define IS_XSPI_ADDR_MODE(mode)                   (((mode) == HAL_XSPI_ADDR_NONE)      \
                                                   || ((mode) == HAL_XSPI_ADDR_1LINE)  \
                                                   || ((mode) == HAL_XSPI_ADDR_2LINES) \
                                                   || ((mode) == HAL_XSPI_ADDR_4LINES) \
                                                   || ((mode) == HAL_XSPI_ADDR_8LINES))

/**
  * @brief Check the Address width
  */
#define IS_XSPI_ADDR_WIDTH(width)                 (((width) == HAL_XSPI_ADDR_8BIT)     \
                                                   || ((width) == HAL_XSPI_ADDR_16BIT) \
                                                   || ((width) == HAL_XSPI_ADDR_24BIT) \
                                                   || ((width) == HAL_XSPI_ADDR_32BIT))

/**
  * @brief Check the Address dtr mode
  */
#define IS_XSPI_ADDR_DTR_MODE(mode)               (((mode) == HAL_XSPI_ADDR_DTR_DISABLED) \
                                                   || ((mode) == HAL_XSPI_ADDR_DTR_ENABLED))

/**
  * @brief Check the Alternate bytes mode
  */
#define IS_XSPI_ALTERNATE_BYTES_MODE(mode)        (((mode) == HAL_XSPI_ALTERNATE_BYTES_NONE)      \
                                                   || ((mode) == HAL_XSPI_ALTERNATE_BYTES_1LINE)  \
                                                   || ((mode) == HAL_XSPI_ALTERNATE_BYTES_2LINES) \
                                                   || ((mode) == HAL_XSPI_ALTERNATE_BYTES_4LINES) \
                                                   || ((mode) == HAL_XSPI_ALTERNATE_BYTES_8LINES))

/**
  * @brief Check the Alternate bytes width
  */
#define IS_XSPI_ALTERNATE_BYTES_WIDTH(width)      (((width) == HAL_XSPI_ALTERNATE_BYTES_8BIT)     \
                                                   || ((width) == HAL_XSPI_ALTERNATE_BYTES_16BIT) \
                                                   || ((width) == HAL_XSPI_ALTERNATE_BYTES_24BIT) \
                                                   || ((width) == HAL_XSPI_ALTERNATE_BYTES_32BIT))

/**
  * @brief Check the Alternate bytes dtr mode
  */
#define IS_XSPI_ALTERNATE_BYTES_DTR_MODE(mode)    (((mode) == HAL_XSPI_ALTERNATE_BYTES_DTR_DISABLED) \
                                                   || ((mode) == HAL_XSPI_ALTERNATE_BYTES_DTR_ENABLED))

/**
  * @brief Check the Regular data mode
  */
#define IS_XSPI_REGULAR_DATA_MODE(instance, mode) (((mode) == HAL_XSPI_REGULAR_DATA_NONE)      \
                                                   || ((mode) == HAL_XSPI_REGULAR_DATA_1LINE)  \
                                                   || ((mode) == HAL_XSPI_REGULAR_DATA_2LINES) \
                                                   || ((mode) == HAL_XSPI_REGULAR_DATA_4LINES) \
                                                   || ((mode) == HAL_XSPI_REGULAR_DATA_8LINES))

/**
  * @brief Check the Hyperbus data mode
  */
#define IS_XSPI_HYPERBUS_DATA_MODE(instance, mode) (((mode) == HAL_XSPI_HYPERBUS_DATA_8LINES))

/**
  * @brief Check the Data length
  */
#define IS_XSPI_DATA_LENGTH(number)               ((number) >= 1U)

/**
  * @brief Check the Data dtr mode
  */
#define IS_XSPI_DATA_DTR_MODE(mode)               (((mode) == HAL_XSPI_DATA_DTR_DISABLED) \
                                                   || ((mode) == HAL_XSPI_DATA_DTR_ENABLED))

/**
  * @brief Check the Dummy cycles
  */
#define IS_XSPI_DUMMY_CYCLES(number)              ((number) <= 31U)

/**
  * @brief Check the Dqs mode
  */
#define IS_XSPI_DQS_MODE(mode)                    (((mode) == HAL_XSPI_DQS_DISABLED) \
                                                   || ((mode) == HAL_XSPI_DQS_ENABLED))

/**
  * @brief Check the RW recovery time cycle
  */
#define IS_XSPI_RW_RECOVERY_TIME_CYCLE(cycle)     ((cycle) <= 255U)

/**
  * @brief Check the Access time cycle
  */
#define IS_XSPI_ACCESS_TIME_CYCLE(cycle)          ((cycle) <= 255U)

/**
  * @brief Check the Write zero latency
  */
#define IS_XSPI_WRITE_ZERO_LATENCY(mode)          (((mode) == HAL_XSPI_WRITE_ZERO_LATENCY_DISABLED) \
                                                   || ((mode) == HAL_XSPI_WRITE_ZERO_LATENCY_ENABLED))
/**
  * @brief Check the Latency mode
  */
#define IS_XSPI_LATENCY_MODE(mode)                (((mode) == HAL_XSPI_LATENCY_VARIABLE) \
                                                   || ((mode) == HAL_XSPI_LATENCY_FIXED))

/**
  * @brief Check the Address space
  */
#define IS_XSPI_ADDRESS_SPACE(SPACE)              (((SPACE) == HAL_XSPI_ADDR_MEMORY) \
                                                   || ((SPACE) == HAL_XSPI_ADDR_REGISTER))

/**
  * @brief Check the Match mode
  */
#define IS_XSPI_MATCH_MODE(mode)                  (((mode) == HAL_XSPI_MATCH_MODE_AND) \
                                                   || ((mode) == HAL_XSPI_MATCH_MODE_OR))

/**
  * @brief Check the Autromatic stop
  */
#define IS_XSPI_AUTOMATIC_STOP(mode)              (((mode) == HAL_XSPI_AUTOMATIC_STOP_ENABLED) \
                                                   || ((mode) == HAL_XSPI_AUTOMATIC_STOP_DISABLED))

/**
  * @brief Check the Interval time
  */
#define IS_XSPI_INTERVAL(interval)                ((interval) <= 0xFFFFU)

/**
  * @brief Check the Status bytes size
  */
#define IS_XSPI_STATUS_BYTES_SIZE(size)           (((size) >= 1U) && ((size) <= 4U))

/**
  * @brief Check the Timeout activation
  */
#define IS_XSPI_TIMEOUT_ACTIVATION(mode)          (((mode) == HAL_XSPI_TIMEOUT_DISABLE) \
                                                   || ((mode) == HAL_XSPI_TIMEOUT_ENABLE))

/**
  * @brief Check the Timeout period
  */
#define IS_XSPI_TIMEOUT_PERIOD(period)            ((period) <= 0xFFFFU)


/**
  * @brief Check XSPI optional interrupt
  */
#define IS_XSPI_OPT_IT(value)                     (((value) == HAL_XSPI_OPT_IT_NONE)  \
                                                   || ((value) == HAL_XSPI_OPT_IT_HT) \
                                                   || ((value) == HAL_XSPI_OPT_IT_DEFAULT))

/**
  * @}
  */

