MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
/* Private types -----------------------------------------------------------------------------------------------------*/
/** @defgroup XSPI_Private_Types XSPI Private Types
  * @{
  */
/*! XSPI Interrupt state*/
typedef enum
{
  XSPI_INTERRUPT_DISABLE = 0U, /*!< HAL XSPI interrupt disabled */
  XSPI_INTERRUPT_ENABLE  = 1U, /*!< HAL XSPI interrupt enabled  */

} hal_xspi_interrupt_state_t;
/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup XSPI_Private_Functions XSPI Private Functions
  * @{
  */
static hal_status_t XSPI_WaitFlagStateUntilTimeout(hal_xspi_handle_t *hxspi, uint32_t flag,
                                                   hal_xspi_flag_status_t state, uint32_t timeout_ms);
static hal_status_t XSPI_SendRegularCmd(hal_xspi_handle_t *hxspi, const hal_xspi_regular_cmd_t *p_cmd,
                                        uint32_t timeout_ms, hal_xspi_interrupt_state_t it_state);
#if defined(XSPI_SR_SMF)
static hal_status_t XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi, const hal_xspi_auto_polling_config_t *p_config,
                                             uint32_t timeout_ms, hal_xspi_interrupt_state_t it_state);
#else
static hal_status_t XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi, const hal_xspi_auto_polling_config_t *p_config,
                                             uint32_t timeout_ms);
#endif /* XSPI_SR_SMF */
static hal_status_t XSPI_Abort(hal_xspi_handle_t *hxspi, uint32_t timeout_ms);

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
static void  XSPI_DMACplt(hal_dma_handle_t *hdma);
static void  XSPI_DMAHalfCplt(hal_dma_handle_t *hdma);
static void  XSPI_DMAError(hal_dma_handle_t *hdma);
static void  XSPI_DMAAbort(hal_dma_handle_t *hdma);
static void  XSPI_DMAAbortOnError(hal_dma_handle_t *hdma);
#endif /* USE_HAL_XSPI_DMA */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup XSPI_Exported_Functions
  * @{
  */

/** @addtogroup XSPI_Exported_Functions_Group1
  * @{
This subsection provides a set of functions allowing to initialize and deinitialize the XSPIx peripheral:
- Call the function HAL_XSPI_Init() to initialize the selected HAL XSPI handle and associate an XSPI
  peripheral instance.
- Call the function HAL_XSPI_DeInit() to de-initialize the given HAL XSPI instance by stopping any ongoing process and
  resetting the state machine.

  */

/**
  * @brief  Initialize the XSPI according to the associated instance.
  * @param  instance XSPI instance, can be one of the XSPI instances as defined in the CMSIS device
  *                  header file.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @note   The XSPI clock can be activated within the HAL_XSPI_Init() function by setting
  *         the <b> USE_XSPI_CLK_ENABLE_MODEL </b> flag to **HAL_CLK_ENABLE_XSPI_ONLY**
  *         in the configuration file ** stm32tnxx_hal_conf.h **.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            hxspi instance has been correctly Initialized.
  */
hal_status_t HAL_XSPI_Init(hal_xspi_handle_t *hxspi, hal_xspi_t instance)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_ALL_INSTANCE((XSPI_TypeDef *)((uint32_t)instance)));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hxspi == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif  /* USE_HAL_CHECK_PARAM */

  /* Associate physical instance to logical object. */
  hxspi->instance = instance;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
  hxspi->p_error_cb          = HAL_XSPI_ErrorCallback;          /* Error callback reset.            */
  hxspi->p_abort_cplt_cb     = HAL_XSPI_AbortCpltCallback;      /* Abort callback reset.            */
  hxspi->p_fifo_threshold_cb = HAL_XSPI_FifoThresholdCallback;  /* FIFO Threshold callback reset.   */
  hxspi->p_cmd_cplt_cb       = HAL_XSPI_CmdCpltCallback;        /* Command Complete callback reset. */
  hxspi->p_rx_cplt_cb        = HAL_XSPI_RxCpltCallback;         /* Rx Complete callback reset.      */
  hxspi->p_tx_cplt_cb        = HAL_XSPI_TxCpltCallback;         /* Tx Complete callback reset.      */
  hxspi->p_rx_half_cplt_cb   = HAL_XSPI_RxHalfCpltCallback;     /* Rx Half Complete callback reset  */
  hxspi->p_tx_half_cplt_cb   = HAL_XSPI_TxHalfCpltCallback;     /* Tx Half Complete callback reset  */
  hxspi->p_status_match_cb   = HAL_XSPI_StatusMatchCallback;    /* Status Match callback reset      */
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

#if defined(USE_HAL_XSPI_CLK_ENABLE_MODEL) && (USE_HAL_XSPI_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable the XSPI Peripheral Clock. */
  switch (hxspi->instance)
  {
    case HAL_XSPI1:
      /* Enable Clock. */
      HAL_RCC_XSPI1_EnableClock();
      break;
    default:
      break;
  }
#endif /* USE_HAL_XSPI_CLK_ENABLE_MODEL */

#if defined (USE_HAL_XSPI_USER_DATA) && (USE_HAL_XSPI_USER_DATA == 1U)
  hxspi->p_user_data = NULL;
#endif /* USE_HAL_XSPI_USER_DATA */

#if defined (USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  hxspi->global_state = HAL_XSPI_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  De-Initialize the XSPI peripheral.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  */
void HAL_XSPI_DeInit(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_ALL_INSTANCE(XSPI_GET_INSTANCE(hxspi)));

  /* Abort the current XSPI operation. */
  (void)XSPI_Abort(hxspi, XSPI_TIMEOUT_DEFAULT_VALUE);

  /* Disable XSPI Instances. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_EN);

  hxspi->global_state = HAL_XSPI_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup XSPI_Exported_Functions_Group2
  * @{
This subsection provides a set of functions to configure the XSPIx peripheral:

