MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
There are three categories of HAL configuration APIs:

- Global configuration APIs:
  - HAL_XSPI_SetConfig()  Set the HAL peripheral instance into a ready-to-use state (idle)
  according to the user parameters
  - HAL_XSPI_GetConfig()  Retrieve the HAL peripheral configuration
- Unitary configuration APIs:
  - HAL_XSPI_SetFifoThreshold()          Configure the FIFO threshold according to the user parameters.
  - HAL_XSPI_GetFifoThreshold()          Retrieve the FIFO threshold configuration.
  - HAL_XSPI_SetPrescaler()              Configure the prescaler according to the user parameters.
  - HAL_XSPI_GetPrescaler()              Retrieve the prescaler configuration.
  - HAL_XSPI_SetMemorySize()             Configure the XSPI memory size according to the user parameters.
  - HAL_XSPI_GetMemorySize()             Retrieve the XSPI memory size configuration.
  - HAL_XSPI_SetMemoryType()             Configure the XSPI memory type according to the user parameters.
  - HAL_XSPI_GetMemoryType()             Retrieve the XSPI memory type configuration.
  - HAL_XSPI_SetMemorySelection()        Configure the nCS used for memory selection.
  - HAL_XSPI_GetMemorySelection()        Retrieve the nCS used for memory selection.
  - HAL_XSPI_EnableFreeRunningClock()    Enable the free-running clock.
  - HAL_XSPI_DisableFreeRunningClock()   Disable the free-running clock.
  - HAL_XSPI_IsEnabledFreeRunningClock() Check whether the free-running clock is enabled.
  - HAL_XSPI_EnablePrefetchData()        Enable automatic prefetch in the external memory (reset value).
  - HAL_XSPI_DisablePrefetchData()       Disable automatic prefetch in the external memory.
  - HAL_XSPI_IsEnabledPrefetchData()     Check the state of automatic prefetch in the external memory.

These APIs are intended to dynamically modify/retrieve a unitary item, meaning that a global configuration has already
been applied.
Unitary configuration APIs must first check whether the driver is in the IDLE state (meaning a global configuration was
applied) in order to modify or retrieve a single item.
Items that can alter other configuration parameters must not be handled within unitary APIs.
  */

/**
  * @brief  Configure the XSPI according to the user parameters.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_config          Pointer to the hal_xspi_config_t structure.
  * @retval HAL_ERROR         XSPI instance is already configured and can not be modified.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            XSPI instance has been correctly configured.
  */
hal_status_t HAL_XSPI_SetConfig(hal_xspi_handle_t *hxspi, const hal_xspi_config_t *p_config)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_MODE(p_config->memory.mode));
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_TYPE(p_config->memory.type));
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_SIZE(p_config->memory.size_bit));
#if defined(XSPI_DCR2_WRAPSIZE)
  ASSERT_DBG_PARAM(IS_XSPI_WRAP_SIZE(p_config->memory.wrap_size_byte));
#endif /* XSPI_DCR2_WRAPSIZE */
#if defined(XSPI_DCR3_CSBOUND)
  ASSERT_DBG_PARAM(IS_XSPI_CS_BOUNDARY(p_config->memory.cs_boundary));
#endif /* XSPI_DCR3_CSBOUND */
  ASSERT_DBG_PARAM(IS_XSPI_CS_HIGH_TIME_CYCLE(p_config->timing.cs_high_time_cycle));
  ASSERT_DBG_PARAM(IS_XSPI_CLOCK_PRESCALER(p_config->timing.clk_prescaler));
  ASSERT_DBG_PARAM(IS_XSPI_SAMPLE_SHIFT(p_config->timing.shift));
  ASSERT_DBG_PARAM(IS_XSPI_DELAY_HOLD(p_config->timing.hold));
  ASSERT_DBG_PARAM(IS_XSPI_DLYB_BYPASS(p_config->timing.dlyb_state));
#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  if (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
  {
    ASSERT_DBG_PARAM(IS_XSPI_WRITE_ZERO_LATENCY(p_config->hyperbus.write_zero_latency));
    ASSERT_DBG_PARAM(IS_XSPI_RW_RECOVERY_TIME_CYCLE(p_config->hyperbus.rw_recovery_time_cycle));
    ASSERT_DBG_PARAM(IS_XSPI_ACCESS_TIME_CYCLE(p_config->hyperbus.access_time_cycle));
    ASSERT_DBG_PARAM(IS_XSPI_LATENCY_MODE(p_config->hyperbus.latency_mode));
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_INIT | HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_EN);

  /* Configure memory type, device size, chip select high time cycle, clock mode. */
  hxspi->type = p_config->memory.type ;
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR1,
                   (XSPI_DCR1_MTYP | XSPI_DCR1_DEVSIZE | XSPI_DCR1_CSHT |
                    XSPI_DCR1_CKMODE),
                   ((uint32_t)(p_config->memory.type) |
                    ((uint32_t)(p_config->memory.size_bit)) |
                    (((uint32_t)(p_config->timing.cs_high_time_cycle) - 1U) << XSPI_DCR1_CSHT_Pos)));

  /* Configure delay block bypass. */
  if (IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)))
  {
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_DLYBYP, (uint32_t)(p_config->timing.dlyb_state));
  }

#if defined(XSPI_DCR2_WRAPSIZE)
  /* Configure wrap size. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR2, XSPI_DCR2_WRAPSIZE, (uint32_t)(p_config->memory.wrap_size_byte));
#endif /* XSPI_DCR2_WRAPSIZE */

#if defined(XSPI_DCR3_CSBOUND)
  /* Configure chip select boundary. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR3, XSPI_DCR3_CSBOUND, ((uint32_t)(p_config->memory.cs_boundary)
                                                                       << XSPI_DCR3_CSBOUND_Pos));
#endif /* XSPI_DCR3_CSBOUND */

#if defined(XSPI_DCR4_REFRESH)
  /* Configure refresh. */
  XSPI_GET_INSTANCE(hxspi)->DCR4 = p_config->timing.cs_refresh_time_cycle;
#endif /* XSPI_DCR4_REFRESH */

