MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  /* Configure new FIFO threshold. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FTHRES, 0U);
  hxspi->fifo_threshold = 1U;

  /* Wait until the busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK)
  {
    /* Configure clock prescaler. */
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR2, XSPI_DCR2_PRESCALER, ((p_config->timing.clk_prescaler)
                                                                           << XSPI_DCR2_PRESCALER_Pos));

    /* Configure the memory mode. */
    hxspi->mode = p_config->memory.mode ;
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMM, (uint32_t)(p_config->memory.mode));

    /* Configure sample shifting and delay hold quarter cycle. */
    hxspi->hold = p_config->timing.hold;
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->TCR, (XSPI_TCR_SSHIFT | XSPI_TCR_DHQC),
                     ((uint32_t)p_config->timing.shift | (uint32_t)p_config->timing.hold));
  }
  else
  {
    hxspi->global_state = HAL_XSPI_STATE_INIT;

    return HAL_ERROR;
  }
#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  /* Configure Hyperbus Memory. */
  if (p_config->memory.type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
  {
    /* Wait till busy flag is reset. */
    if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                       XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK)
    {
      /* Configure Hyperbus configuration Latency register. */
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->HLCR,
                      (((uint32_t)(p_config->hyperbus.rw_recovery_time_cycle) << XSPI_HLCR_TRWR_Pos) |
                       ((uint32_t)(p_config->hyperbus.access_time_cycle) << XSPI_HLCR_TACC_Pos)      |
                       (uint32_t)(p_config->hyperbus.write_zero_latency)                             |
                       (uint32_t)(p_config->hyperbus.latency_mode)));
    }
    else
    {
      hxspi->global_state = HAL_XSPI_STATE_INIT;

      return HAL_ERROR;
    }
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

  /* Enable XSPI. */
  STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_EN);

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the XSPI configuration.
  * @param  hxspi    Pointer to a \ref hal_xspi_handle_t structure that contains
  *                  the handle information for the specified XSPI instance.
  * @param  p_config Pointer to the hal_xspi_config_t structure.
  */
void HAL_XSPI_GetConfig(hal_xspi_handle_t *hxspi, hal_xspi_config_t *p_config)
{
  uint32_t tmp_dcr1_reg;
  uint32_t tmp_dcr2_reg;
#if defined(XSPI_DCR3_CSBOUND)
  uint32_t tmp_dcr3_reg;
#endif /* XSPI_DCR3_CSBOUND */
#if defined(XSPI_DCR4_REFRESH)
  uint32_t tmp_dcr4_reg;
#endif /* XSPI_DCR4_REFRESH */
  uint32_t tmp_tcr_reg;
  uint32_t tmp_cr_reg;
  uint32_t tmp_reg;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  tmp_dcr1_reg = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DCR1);
  tmp_dcr2_reg = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DCR2);
#if defined(XSPI_DCR3_CSBOUND)
  tmp_dcr3_reg = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DCR3);
#endif /* XSPI_DCR3_CSBOUND */
#if defined(XSPI_DCR4_REFRESH)
  tmp_dcr4_reg = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DCR4);
#endif /* XSPI_DCR4_REFRESH */
  tmp_cr_reg   = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->CR) ;
  tmp_tcr_reg  = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->TCR);

#if defined(XSPI_DCR3_CSBOUND)
  /* Retrieve the value of chip select boundary */
  tmp_reg = STM32_READ_BIT(tmp_dcr3_reg, XSPI_DCR3_CSBOUND) >> XSPI_DCR3_CSBOUND_Pos;
  p_config->memory.cs_boundary = (hal_xspi_cs_boundary_t)tmp_reg;
#endif /* XSPI_DCR3_CSBOUND */

  /* Retrieve the value of Memory mode */
  tmp_reg = STM32_READ_BIT(tmp_cr_reg, XSPI_CR_DMM);
  p_config->memory.mode = (hal_xspi_memory_mode_t)tmp_reg;
  hxspi->mode         = (hal_xspi_memory_mode_t)tmp_reg;

  /* Retrieve the value of Memory type */
  tmp_reg = STM32_READ_BIT(tmp_dcr1_reg, XSPI_DCR1_MTYP);
  p_config->memory.type = (hal_xspi_memory_type_t)tmp_reg;
  hxspi->type           = (hal_xspi_memory_type_t)tmp_reg;

  /* Retrieve the value of device size*/
  tmp_reg = STM32_READ_BIT(tmp_dcr1_reg, XSPI_DCR1_DEVSIZE);
  p_config->memory.size_bit = (hal_xspi_memory_size_t)tmp_reg;

#if defined(XSPI_DCR2_WRAPSIZE)
  /* Retrieve the value of wrap size */
  tmp_reg = STM32_READ_BIT(tmp_dcr2_reg, XSPI_DCR2_WRAPSIZE);
  p_config->memory.wrap_size_byte = (hal_xspi_wrap_size_t)tmp_reg;
#endif /* XSPI_DCR2_WRAPSIZE */

  /* Retrieve the value of chip select high time */
  tmp_reg = (STM32_READ_BIT(tmp_dcr1_reg, XSPI_DCR1_CSHT) >> XSPI_DCR1_CSHT_Pos) + 1U;
  p_config->timing.cs_high_time_cycle = tmp_reg;

  /* Retrieve the value of clock prescaler */
  tmp_reg = STM32_READ_BIT(tmp_dcr2_reg, XSPI_DCR2_PRESCALER) >> XSPI_DCR2_PRESCALER_Pos;
  p_config->timing.clk_prescaler = tmp_reg;

  /* Retrieve the value of sample shifting */
  tmp_reg = STM32_READ_BIT(tmp_tcr_reg, XSPI_TCR_SSHIFT);
  p_config->timing.shift = (hal_xspi_sample_shift_t)tmp_reg;

  /* Retrieve the value of delay hold quarter cycle */
  tmp_reg = STM32_READ_BIT(tmp_tcr_reg, XSPI_TCR_DHQC);
  p_config->timing.hold = (hal_xspi_delay_hold_t)tmp_reg;
  hxspi->hold           = (hal_xspi_delay_hold_t)tmp_reg;

  if (IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)))
  {
    /* Retrieve the value of delay block bypass */
    tmp_reg = STM32_READ_BIT(tmp_dcr1_reg, XSPI_DCR1_DLYBYP);
    p_config->timing.dlyb_state = (hal_xspi_dlyb_state_t)tmp_reg;
  }

#if defined(XSPI_DCR4_REFRESH)
  /* Retrieve the value of refresh */
  tmp_reg = STM32_READ_BIT(tmp_dcr4_reg, XSPI_DCR4_REFRESH);
  p_config->timing.cs_refresh_time_cycle = tmp_reg;
#endif /* XSPI_DCR4_REFRESH */

#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  uint32_t tmp_HLCR = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->HLCR);
  /* Retrieve the XSPI hyperbus configuration */
  if (p_config->memory.type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
  {
    tmp_reg = STM32_READ_BIT(tmp_HLCR, XSPI_HLCR_TRWR);
    p_config->hyperbus.rw_recovery_time_cycle = tmp_reg;

    tmp_reg = STM32_READ_BIT(tmp_HLCR, XSPI_HLCR_TACC);
    p_config->hyperbus.access_time_cycle = tmp_reg;

    tmp_reg = STM32_READ_BIT(tmp_HLCR, XSPI_HLCR_WZL) >> XSPI_HLCR_WZL_Pos;
    p_config->hyperbus.write_zero_latency = (hal_xspi_write_zero_latency_status_t)tmp_reg;

    tmp_reg = STM32_READ_BIT(tmp_HLCR, XSPI_HLCR_LM);
    p_config->hyperbus.latency_mode = (hal_xspi_latency_mode_t)tmp_reg;
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */
}

/** @brief  Set the XSPI FIFO threshold.
  * @param  hxspi     Pointer to a \ref hal_xspi_handle_t structure that contains
  *                   the handle information for the specified XSPI instance.
  * @param  threshold Threshold of the FIFO can be a value from 0 to 31.
  * @retval HAL_OK    FIFO threshold has been correctly configured.
  */
hal_status_t HAL_XSPI_SetFifoThreshold(hal_xspi_handle_t *hxspi, uint32_t threshold)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_FIFO_THRESHOLD_BYTE(XSPI_GET_INSTANCE(hxspi), threshold));

