MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Set the XSPI FIFO threshold. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FTHRES, ((threshold - 1U) << XSPI_CR_FTHRES_Pos));

  hxspi->fifo_threshold = threshold;

  return HAL_OK;
}

/** @brief  Get the XSPI FIFO threshold.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the FIFO threshold value.
  */
uint32_t HAL_XSPI_GetFifoThreshold(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the XSPI FIFO threshold. */
  return ((STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FTHRES) >> XSPI_CR_FTHRES_Pos) + 1U);
}

/** @brief  Set XSPI Clock Prescaler.
  * @param  hxspi         Pointer to a \ref hal_xspi_handle_t structure that contains
  *                       the handle information for the specified XSPI instance.
  * @param  clk_prescaler Prescaler generating the external clock can be a value from 0 to 255.
  * @retval HAL_ERROR     An error has occurred.
  * @retval HAL_OK        Clock Prescaler has been correctly configured.
  */
hal_status_t HAL_XSPI_SetPrescaler(hal_xspi_handle_t *hxspi, uint32_t clk_prescaler)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_CLOCK_PRESCALER(clk_prescaler));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK)
  {
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR2, XSPI_DCR2_PRESCALER,
                     (clk_prescaler << XSPI_DCR2_PRESCALER_Pos));

  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/** @brief  Get XSPI Clock Prescaler.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the value clock prescaler.
  */
uint32_t HAL_XSPI_GetPrescaler(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the XSPI prescaler. */
  return (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->DCR2, XSPI_DCR2_PRESCALER) >> XSPI_DCR2_PRESCALER_Pos);
}

/** @brief  Configure device memory size.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @param  size   The size of the external device connected to the XSPI.
  * @retval HAL_OK Size has been correctly configured.
  */
hal_status_t HAL_XSPI_SetMemorySize(hal_xspi_handle_t *hxspi, hal_xspi_memory_size_t size)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_SIZE(size));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Set the XSPI memory size. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_DEVSIZE, (uint32_t)size);

  return HAL_OK;
}

/** @brief  Get XSPI Memory Size.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the value device memory size.
  */
hal_xspi_memory_size_t HAL_XSPI_GetMemorySize(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the XSPI memory size. */
  return ((hal_xspi_memory_size_t)(uint32_t)STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_DEVSIZE));
}

/** @brief  Set XSPI Memory Type.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @param  type   The type of the external device connected to the XSPI.
  * @retval HAL_OK Type has been correctly configured.
  */
hal_status_t HAL_XSPI_SetMemoryType(hal_xspi_handle_t *hxspi, hal_xspi_memory_type_t type)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_TYPE(type));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Set the XSPI memory type. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_MTYP, (uint32_t)type);

  hxspi->type = type;

  return HAL_OK;
}

/** @brief  Get XSPI Memory Type.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @return Retrieve the type of the external device connected to the XSPI.
  */
hal_xspi_memory_type_t HAL_XSPI_GetMemoryType(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the XSPI memory type. */
  return (hxspi->type);
}

/** @brief  Set XSPI Memory Selection.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @param  select The nCS use by the XSPI to select the external device.
  * @retval HAL_OK Type has been correctly configured.
  */
hal_status_t HAL_XSPI_SetMemorySelection(hal_xspi_handle_t *hxspi, hal_xspi_memory_selection_t select)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_MEMORY_SELECTION(select));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Set the XSPI memory type. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_CSSEL, (uint32_t)select);

  return HAL_OK;
}

/** @brief  Get XSPI Memory Selection.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @return Retrieve the nCS used to select the external device connected to the XSPI.
  */
hal_xspi_memory_selection_t HAL_XSPI_GetMemorySelection(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

