MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the XSPI memory type. */
  return ((hal_xspi_memory_selection_t)(uint32_t)STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_CSSEL));
}


/** @brief  Get Base Address of XSPI in Memory-Mapped mode.
  * @param  hxspi  XSPI handle.
  * @return Retrieve the base address of the XSPI peripheral (or 0U in case of error).
  */
uint32_t HAL_XSPI_GetMemoryMappedBaseAddress(const hal_xspi_handle_t *hxspi)
{
  uint32_t base_address;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_ALL_INSTANCE(XSPI_GET_INSTANCE(hxspi)));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE | HAL_XSPI_STATE_INIT
                   | HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE);

  switch (hxspi->instance)
  {
    case HAL_XSPI1:
      base_address = XSPI1_BASE;
      break;
    default:
      /* Return 0U (error) if instance doesn't exist. */
      base_address = 0U;
      break;
  }

  return base_address;
}

/** @brief  Enable the free running clock.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @retval HAL_OK free running clock has been correctly enabled.
  */
hal_status_t HAL_XSPI_EnableFreeRunningClock(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Enable the free running clock. */
  STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  return HAL_OK;
}

/** @brief  Disable the free running clock.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @retval HAL_OK free running clock has been correctly disabled.
  */
hal_status_t HAL_XSPI_DisableFreeRunningClock(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Disable the free running clock. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  return HAL_OK;
}

/** @brief  Check whether the free running clock is enabled or disabled.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the state of the free running clock.
  */
hal_xspi_free_running_clk_status_t HAL_XSPI_IsEnabledFreeRunningClock(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Get the free running clock. */
  return ((STM32_READ_BIT((XSPI_GET_INSTANCE(hxspi))->DCR1, XSPI_DCR1_FRCK) == 0UL) ? HAL_XSPI_FREE_RUNNING_CLK_DISABLED
          : HAL_XSPI_FREE_RUNNING_CLK_ENABLED);
}

/** @brief  Enable automatic prefetch in the external memory (Enabled by default).
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @retval HAL_OK automatic prefetch has been correctly enabled.
  */
hal_status_t HAL_XSPI_EnablePrefetchData(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Enable the automatic prefetch. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_NOPREF);

  return HAL_OK;
}
/** @brief  Disable automatic prefetch in the external memory.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @retval HAL_OK automatic prefetch has been correctly disabled.
  */
hal_status_t HAL_XSPI_DisablePrefetchData(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  /* Disable the automatic prefetch. */
  STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_NOPREF);

  return HAL_OK;
}
/** @brief  Check whether the automatic prefetch is enabled or disabled.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the state of the automatic prefetch.
  */
hal_xspi_prefetch_data_status_t HAL_XSPI_IsEnabledPrefetchData(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE | HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE);

  /* Get the automatic prefetch status. */
  return ((STM32_READ_BIT((XSPI_GET_INSTANCE(hxspi))->CR, XSPI_CR_NOPREF) == 0UL) ? HAL_XSPI_PREFETCH_DATA_ENABLED
          : HAL_XSPI_PREFETCH_DATA_DISABLED);
}
/**
  * @}
  */

/** @addtogroup XSPI_Exported_Functions_Group3
  * @{

This subsection provides a set of functions allowing to manage the data
  transfer from/to external memory

- HAL_XSPI_StartMemoryMappedMode() Allowing to start a XSPI Memory-Mapped mode according to the user parameters
- HAL_XSPI_StopMemoryMappedMode() Allowing to stop a XSPI Memory-Mapped mode

There are 3 categories of HAL functions APIs to manage the data transfer

- Blocking mode: Polling
  - HAL_XSPI_SendRegularCmd()
  - HAL_XSPI_SendHyperbusCmd()
  - HAL_XSPI_ExecRegularAutoPoll()
  - HAL_XSPI_Transmit()
  - HAL_XSPI_Receive()
  - HAL_XSPI_Abort()

- Non-Blocking mode: IT
 - HAL_XSPI_SendRegularCmd_IT()
 - HAL_XSPI_ExecRegularAutoPoll_IT()
 - HAL_XSPI_Transmit_IT()
 - HAL_XSPI_Receive_IT()
 - HAL_XSPI_Abort_IT()

- Non-Blocking mode: DMA
 - HAL_XSPI_Transmit_DMA()
 - HAL_XSPI_Receive_DMA()
 - HAL_XSPI_Transmit_DMA_Opt()
 - HAL_XSPI_Receive_DMA_Opt()
  */

/**
  * @brief  Start the Memory Mapped mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_config          Pointer to structure that contains the memory mapped configuration information.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            XSPI instance has been correctly configured.
  */
hal_status_t HAL_XSPI_StartMemoryMappedMode(hal_xspi_handle_t *hxspi, const hal_xspi_memory_mapped_config_t *p_config)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_TIMEOUT_ACTIVATION(p_config->timeout_activation));
  ASSERT_DBG_PARAM(IS_XSPI_TIMEOUT_PERIOD(p_config->timeout_period_cycle));

