MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE);

  /* Start the memory mapped mode. */
  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     XSPI_TIMEOUT_DEFAULT_VALUE) == HAL_OK)
  {
    if (p_config->timeout_activation == HAL_XSPI_TIMEOUT_ENABLE)
    {
      /* Configure LPTR register. */
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->LPTR, p_config->timeout_period_cycle);

      /* Clear Timeout flag. */
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TO);

      /* Enable interrupt on the timeout flag. */
      HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TO);
    }
    /* Set functional mode as memory-mapped. */
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, (XSPI_CR_TCEN | XSPI_CR_FMODE),
                     ((uint32_t)p_config->timeout_activation | XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED));
  }
  else
  {
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Stop the Memory Mapped mode.
  * @param  hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                the handle information for the specified XSPI instance.
  * @note   This function is used only in Memory mapped Mode.
  * @retval HAL_ERROR An error has occurred.
  * @retval HAL_OK    XSPI instance has been correctly configured.
  */
hal_status_t HAL_XSPI_StopMemoryMappedMode(hal_xspi_handle_t *hxspi)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE);

  /* Abort the current XSPI operation if exist */
  status = XSPI_Abort(hxspi, XSPI_TIMEOUT_DEFAULT_VALUE);

  if (status == HAL_OK)
  {
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
  }
  else
  {
    status = HAL_ERROR;
  }

  return status;
}
/**
  * @brief  Set the Regular command configuration.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  p_cmd       Structure that contains the Regular command configuration information.
  * @param  timeout_ms  Timeout duration.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_SendRegularCmd(hal_xspi_handle_t *hxspi,
                                     const hal_xspi_regular_cmd_t *p_cmd,
                                     uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_cmd != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_OPERATION_TYPE(p_cmd->operation_type));
  ASSERT_DBG_PARAM(IS_XSPI_IO_SELECT(XSPI_GET_INSTANCE(hxspi), p_cmd->io_select));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_MODE(p_cmd->instruction_mode));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_WIDTH(p_cmd->instruction_width));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_DTR_MODE(p_cmd->instruction_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_MODE(p_cmd->addr_mode));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_WIDTH(p_cmd->addr_width));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_DTR_MODE(p_cmd->addr_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_MODE(p_cmd->alternate_bytes_mode));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_WIDTH(p_cmd->alternate_bytes_width));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_DTR_MODE(p_cmd->alternate_bytes_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_REGULAR_DATA_MODE(XSPI_GET_INSTANCE(hxspi), p_cmd->data_mode));
  ASSERT_DBG_PARAM(IS_XSPI_DATA_DTR_MODE(p_cmd->data_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_DUMMY_CYCLES(p_cmd->dummy_cycle));
  ASSERT_DBG_PARAM(IS_XSPI_DQS_MODE(p_cmd->dqs_mode_status));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  if ((p_cmd == NULL) || (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS))
  {
    return HAL_INVALID_PARAM;
  }
#else
  if (p_cmd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_CHECK_PARAM */

  /* Check Data Length only if data are inside command. */
  if (p_cmd->data_mode != HAL_XSPI_REGULAR_DATA_NONE)
  {
    ASSERT_DBG_PARAM(IS_XSPI_DATA_LENGTH(p_cmd->size_byte));
  }

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_CMD_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Send regular command in blocking mode. */
  status = XSPI_SendRegularCmd(hxspi, p_cmd, timeout_ms, XSPI_INTERRUPT_DISABLE);

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return status;
}

/**
  * @brief  Set the Regular command configuration in interrupt mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_cmd             Structure that contains the Regular command configuration information.
  * @note   This function is used only in Indirect Read or Write Modes.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_SendRegularCmd_IT(hal_xspi_handle_t *hxspi, const hal_xspi_regular_cmd_t *p_cmd)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_cmd != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_OPERATION_TYPE(p_cmd->operation_type));
  ASSERT_DBG_PARAM(IS_XSPI_IO_SELECT(XSPI_GET_INSTANCE(hxspi), p_cmd->io_select));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_MODE(p_cmd->instruction_mode));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_WIDTH(p_cmd->instruction_width));
  ASSERT_DBG_PARAM(IS_XSPI_INSTRUCTION_DTR_MODE(p_cmd->instruction_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_MODE(p_cmd->addr_mode));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_WIDTH(p_cmd->addr_width));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_DTR_MODE(p_cmd->addr_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_MODE(p_cmd->alternate_bytes_mode));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_WIDTH(p_cmd->alternate_bytes_width));
  ASSERT_DBG_PARAM(IS_XSPI_ALTERNATE_BYTES_DTR_MODE(p_cmd->alternate_bytes_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_REGULAR_DATA_MODE(XSPI_GET_INSTANCE(hxspi), p_cmd->data_mode));
  ASSERT_DBG_PARAM(IS_XSPI_DATA_DTR_MODE(p_cmd->data_dtr_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_DUMMY_CYCLES(p_cmd->dummy_cycle));
  ASSERT_DBG_PARAM(IS_XSPI_DQS_MODE(p_cmd->dqs_mode_status));

