MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  if ((p_cmd == NULL)
      || (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
      || (p_cmd->operation_type != HAL_XSPI_OPERATION_COMMON_CFG))
  {
    return HAL_INVALID_PARAM;
  }
#else
  if ((p_cmd == NULL) || (p_cmd->operation_type != HAL_XSPI_OPERATION_COMMON_CFG))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_CHECK_PARAM */

  /* Check Data Length only if data are inside command. */
  if (p_cmd->data_mode != HAL_XSPI_REGULAR_DATA_NONE)
  {
    ASSERT_DBG_PARAM(IS_XSPI_DATA_LENGTH(p_cmd->size_byte));
  }

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_CMD_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Send regular command in non-blocking mode. */
  if (XSPI_SendRegularCmd(hxspi, p_cmd, XSPI_TIMEOUT_DEFAULT_VALUE, XSPI_INTERRUPT_ENABLE) != HAL_OK)
  {
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

#if defined(USE_HAL_XSPI_HYPERBUS) && (USE_HAL_XSPI_HYPERBUS == 1U)
#if defined(XSPI_DCR1_MTYP_2)
/**
  * @brief  Set the Hyperbus command configuration.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_cmd             Structure containing the Hyperbus command.
  * @param  timeout_ms        Timeout duration.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_SendHyperbusCmd(hal_xspi_handle_t *hxspi,
                                      const hal_xspi_hyperbus_cmd_t *p_cmd,
                                      uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_cmd != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_DATA_LENGTH(p_cmd->size_byte));
  ASSERT_DBG_PARAM(IS_XSPI_ADDRESS_SPACE(p_cmd->addr_space));
  ASSERT_DBG_PARAM(IS_XSPI_ADDR_WIDTH(p_cmd->addr_width));
  ASSERT_DBG_PARAM(IS_XSPI_DQS_MODE(p_cmd->dqs_mode_status));
  ASSERT_DBG_PARAM(IS_XSPI_HYPERBUS_DATA_MODE(XSPI_GET_INSTANCE(hxspi), p_cmd->data_mode));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((p_cmd == NULL) || (hxspi->type != HAL_XSPI_MEMORY_TYPE_HYPERBUS))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_CMD_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Send hyperbus command in blocking mode. */
  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     timeout_ms) == HAL_OK)
  {
    /* Re-initialize the value of the functional mode. */
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, 0U);

    /* Configure the address space. */
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->DCR1,  XSPI_DCR1_MTYP_0, (uint32_t)p_cmd->addr_space);

    /* Set the following configurations :
    - address size
    - DQS signal enabled (used as RWDS)
    - DTR mode enabled on address and data
    - address and data */
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->CCR, ((uint32_t)p_cmd->dqs_mode_status | XSPI_CCR_DDTR |
                                                    (uint32_t)p_cmd->data_mode | (uint32_t)p_cmd->addr_width |
                                                    XSPI_CCR_ADDTR | XSPI_CCR_ADMODE_2));
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->WCCR, ((uint32_t)p_cmd->dqs_mode_status | XSPI_WCCR_DDTR |
                                                     (uint32_t)p_cmd->data_mode | (uint32_t)p_cmd->addr_width |
                                                     XSPI_WCCR_ADDTR | XSPI_WCCR_ADMODE_2));

    /* Configure the number of data. */
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->DLR, (p_cmd->size_byte - 1U));

    /* Configure the address value. */
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, p_cmd->addr);
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
    {
      hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
    }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    return HAL_TIMEOUT;
  }

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return HAL_OK;
}
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_XSPI_HYPERBUS */

/**
  * @brief  Execute the XSPI Automatic Polling Mode in blocking mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_config          Pointer to structure that contains the polling configuration information.
  * @param  timeout_ms        Timeout duration.
  * @note   This function is used only in Automatic Polling Mode for Regular protocol.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */

hal_status_t HAL_XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi,
                                          const hal_xspi_auto_polling_config_t *p_config,
                                          uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_STATUS_BYTES_SIZE(XSPI_GET_INSTANCE(hxspi)->DLR + 1U));
#if defined(XSPI_SR_SMF)
  ASSERT_DBG_PARAM(IS_XSPI_MATCH_MODE(p_config->match_mode));
#endif /* XSPI_SR_SMF */
  ASSERT_DBG_PARAM(IS_XSPI_INTERVAL(p_config->interval_cycle));
  ASSERT_DBG_PARAM(IS_XSPI_AUTOMATIC_STOP(p_config->automatic_stop_status));

