MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
#if defined(XSPI_DCR1_MTYP_2)
  if ((p_config == NULL)
      || (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
      || (p_config->automatic_stop_status != HAL_XSPI_AUTOMATIC_STOP_ENABLED))
  {
    return HAL_INVALID_PARAM;
  }
#else
  if ((p_config == NULL)
      || (p_config->automatic_stop_status != HAL_XSPI_AUTOMATIC_STOP_ENABLED))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* XSPI_DCR1_MTYP_2 */
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_AUTO_POLLING_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Execute regular auto-polling in blocking mode */
#if defined(XSPI_SR_SMF)
  status = XSPI_ExecRegularAutoPoll(hxspi, p_config, timeout_ms, XSPI_INTERRUPT_DISABLE);
#else
  status = XSPI_ExecRegularAutoPoll(hxspi, p_config, timeout_ms);
#endif /* XSPI_SR_SMF */

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return status;
}

#if defined(XSPI_SR_SMF)
/**
  * @brief  Execute the XSPI Automatic Polling Mode in non-blocking mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_config          Pointer to structure that contains the polling configuration information
  * @note   This function is used only in Automatic Polling Mode for Regular protocol.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_ExecRegularAutoPoll_IT(hal_xspi_handle_t *hxspi, const hal_xspi_auto_polling_config_t *p_config)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_STATUS_BYTES_SIZE(XSPI_GET_INSTANCE(hxspi)->DLR + 1U));
#if defined(XSPI_SR_SMF)
  ASSERT_DBG_PARAM(IS_XSPI_MATCH_MODE(p_config->match_mode));
#endif /* XSPI_SR_SMF */
  ASSERT_DBG_PARAM(IS_XSPI_INTERVAL(p_config->interval_cycle));
  ASSERT_DBG_PARAM(IS_XSPI_AUTOMATIC_STOP(p_config->automatic_stop_status));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((p_config == NULL) || (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_AUTO_POLLING_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Execute regular auto-polling in non-blocking mode */
  if (XSPI_ExecRegularAutoPoll(hxspi, p_config, XSPI_TIMEOUT_DEFAULT_VALUE,
                               XSPI_INTERRUPT_ENABLE) != HAL_OK)
  {
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* XSPI_SR_SMF */

/**
  * @brief  Transmit an amount of data in blocking mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_data            Pointer to data buffer.
  * @param  timeout_ms        Timeout duration.
  * @note   This function is used only in Indirect Write Mode.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Transfer completed.
  */
hal_status_t HAL_XSPI_Transmit(hal_xspi_handle_t *hxspi, const void *p_data, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  volatile uint32_t *p_data_reg = &XSPI_GET_INSTANCE(hxspi)->DR;

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_TX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Configure counters and size. */
  hxspi->xfer_count = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DLR) + 1U;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Configure the functional mode as indirect write. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

  /* Repeat for all data. */
  do
  {
    /* Wait until the FIFO threshold flag is set to send data. */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_FT, HAL_XSPI_FLAG_ACTIVE,
                                            timeout_ms);

    if (status != HAL_OK)
    {
      break;
    }

    *((volatile uint8_t *)p_data_reg) = *hxspi->p_buffer;
    hxspi->p_buffer++;
    hxspi->xfer_count--;

  } while (hxspi->xfer_count > 0U);

  if (status == HAL_OK)
  {
    /* Wait till transfer complete flag is set to go back in idle state. */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_TC, HAL_XSPI_FLAG_ACTIVE,
                                            timeout_ms);

    if (status == HAL_OK)
    {
      /* Clear transfer complete flag. */
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);
    }
  }

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return status;
}

/**
  * @brief  Receive an amount of data in blocking mode.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_data            Pointer to data buffer.
  * @param  timeout_ms        Timeout duration.
  * @note   This function is used only in Indirect Read Mode.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_Receive(hal_xspi_handle_t *hxspi, void *p_data, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

