MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

  volatile uint32_t *p_data_reg = &XSPI_GET_INSTANCE(hxspi)->DR;
  uint32_t addr_reg             = XSPI_GET_INSTANCE(hxspi)->AR;
  uint32_t ir_reg               = XSPI_GET_INSTANCE(hxspi)->IR;

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_RX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Configure counters and size. */
  hxspi->xfer_count = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DLR) + 1U;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Configure the functional mode as indirect read. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

  /* Trig the transfer by re-writing address or instruction register. */
#if defined(XSPI_DCR1_MTYP_2)
  if (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
  }
  else
  {
    if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
    }
    else
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
    }
  }
#else
  if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
  }
  else
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
  }
#endif /* XSPI_DCR1_MTYP_2 */

  do
  {
    /* Wait until the FIFO threshold or transfer complete flags are set to read received data. */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_FT | (uint32_t)HAL_XSPI_FLAG_TC,
                                            HAL_XSPI_FLAG_ACTIVE,  timeout_ms);
    if (status != HAL_OK)
    {
      break;
    }

    *hxspi->p_buffer = *((volatile uint8_t *)p_data_reg);
    hxspi->p_buffer++;
    hxspi->xfer_count--;

  } while (hxspi->xfer_count > 0U);

  if (status == HAL_OK)
  {
    /* Wait till transfer complete flag is set to go back in idle state. */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_TC, HAL_XSPI_FLAG_ACTIVE,
                                            timeout_ms);

    if (status == HAL_OK)
    {
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);
    }
  }

  hxspi->global_state = HAL_XSPI_STATE_IDLE;

  return status;
}

/**
  * @brief  Send an amount of data in non-blocking mode with interrupt.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_data            Pointer to data buffer.
  * @note   This function is used only in Indirect Write Mode.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Transfer completed.
  */
hal_status_t HAL_XSPI_Transmit_IT(hal_xspi_handle_t *hxspi, const void *p_data)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_TX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  /* Store counters and size. */
  hxspi->xfer_count = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DLR) + 1U;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Set functional mode as indirect write. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

  /* Clear flags related to interrupt. */
  HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_TC);

  /* Enable the transfer complete, FIFO threshold, and transfer error interrupts. */
  HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC | (uint32_t)HAL_XSPI_IT_FT | (uint32_t)HAL_XSPI_IT_TE);

  return HAL_OK;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with interrupt.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_data            Pointer to data buffer.
  * @note   This function is used only in Indirect Read Mode.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          XSPI state is active when calling this API.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_Receive_IT(hal_xspi_handle_t *hxspi, void *p_data)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_RX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  uint32_t addr_reg = XSPI_GET_INSTANCE(hxspi)->AR;
  uint32_t ir_reg = XSPI_GET_INSTANCE(hxspi)->IR;

  /* Store counters and size. */
  hxspi->xfer_count = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DLR) + 1U;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Set functional mode as indirect read. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

  /* Clear flags related to interrupt. */
  HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_TC);

  /* Enable the transfer complete, FIFO threshold, and transfer error interrupts. */
  HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC | (uint32_t)HAL_XSPI_IT_FT | (uint32_t)HAL_XSPI_IT_TE);

  /* Trig the transfer by re-writing address or instruction register. */
#if defined(XSPI_DCR1_MTYP_2)
  if (hxspi->type == HAL_XSPI_MEMORY_TYPE_HYPERBUS)
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
  }
  else
  {
    if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
    }
    else
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
    }
  }
#else
  if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
  }
  else
  {
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
  }
#endif /* XSPI_DCR1_MTYP_2 */

  return HAL_OK;
}

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
/**
  * @brief   Send an amount of data in non-blocking mode with DMA.
  * @param   hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                 the handle information for the specified XSPI instance.
  * @param   p_data Pointer to data buffer.
  * @note    This function is used only in Indirect Write Mode.
  * @warning If DMA peripheral access is configured as halfword, the number of data and the FIFO threshold must be
  *          aligned on halfword.
  * @warning If DMA peripheral access is configured as word, the number
  *          of data and the FIFO threshold must be aligned on word.
  * @retval  HAL_ERROR         An error has occurred.
  * @retval  HAL_INVALID_PARAM Invalid parameter.
  * @retval  HAL_BUSY          XSPI state is active when calling this API.
  * @retval  HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_Transmit_DMA(hal_xspi_handle_t *hxspi, const void *p_data)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

