MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_TX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  uint32_t size_byte = XSPI_GET_INSTANCE(hxspi)->DLR + 1U;

  /* Configure counters and size. */
  hxspi->xfer_count = size_byte;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Set functional mode as indirect write. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

  /* Clear flags related to interrupt. */
  HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_TC);

  /* Set the DMA transfer complete callback. */
  hxspi->hdma_tx->p_xfer_cplt_cb = XSPI_DMACplt;

  /* Set the DMA Half transfer complete callback. */
  hxspi->hdma_tx->p_xfer_halfcplt_cb = XSPI_DMAHalfCplt;

  /* Set the DMA error callback. */
  hxspi->hdma_tx->p_xfer_error_cb = XSPI_DMAError;

  /* Start DMA peripheral. */
  if (HAL_DMA_StartPeriphXfer_IT_Opt(hxspi->hdma_tx,
                                     (uint32_t)p_data,
                                     (uint32_t)&XSPI_GET_INSTANCE(hxspi)->DR,
                                     hxspi->xfer_size,
                                     HAL_DMA_OPT_IT_DEFAULT) == HAL_OK)
  {
    /* Enable the transfer error interrupt. */
    HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TE);

    /* Enable the DMA transfer. */
    STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    hxspi->last_error_codes = HAL_XSPI_ERROR_DMA;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief   Send an amount of data with DMA in interrupt mode with optional interrupts.
  * @param   hxspi      Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param   p_data     Pointer to data buffer.
  * @param   interrupts Specifies the DMA optional interrupt to be enabled.
  *                     This parameter can be one of @ref XSPI_Optional_Interrupt group.
  * @note    This function is used only in Indirect Write Mode.
  * @warning If DMA peripheral access is configured as halfword, the number of data and the FIFO threshold must be
  *          aligned on halfword.
  * @warning If DMA peripheral access is configured as word, the number
  *          of data and the FIFO threshold must be aligned on word.
  * @retval  HAL_ERROR         An error has occurred.
  * @retval  HAL_INVALID_PARAM Invalid parameter.
  * @retval  HAL_BUSY          XSPI state is active when calling this API.
  * @retval  HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_Transmit_DMA_Opt(hal_xspi_handle_t *hxspi, const void *p_data, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_OPT_IT(interrupts));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hxspi, global_state, HAL_XSPI_STATE_IDLE, HAL_XSPI_STATE_TX_ACTIVE);

#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
  hxspi->last_error_codes = HAL_XSPI_ERROR_NONE;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

  uint32_t size_byte = XSPI_GET_INSTANCE(hxspi)->DLR + 1U;

  /* Store counters and size. */
  hxspi->xfer_count = size_byte;
  hxspi->xfer_size  = hxspi->xfer_count;
  hxspi->p_buffer   = (uint8_t *)((uint32_t)p_data);

  /* Set functional mode as indirect write. */
  STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

  /* Clear flags related to interrupt. */
  HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_TC);

  /* Set the DMA transfer complete callback. */
  hxspi->hdma_tx->p_xfer_cplt_cb = XSPI_DMACplt;

  if ((interrupts & HAL_XSPI_OPT_IT_HT) != 0U)
  {
    /* Set the DMA Half transfer complete callback. */
    hxspi->hdma_tx->p_xfer_halfcplt_cb = XSPI_DMAHalfCplt;
  }

  /* Set the DMA error callback. */
  hxspi->hdma_tx->p_xfer_error_cb = XSPI_DMAError;

  /* Start DMA peripheral. */
  if (HAL_DMA_StartPeriphXfer_IT_Opt(hxspi->hdma_tx,
                                     (uint32_t)p_data,
                                     (uint32_t)&XSPI_GET_INSTANCE(hxspi)->DR,
                                     hxspi->xfer_size,
                                     interrupts) == HAL_OK)
  {
    /* Enable the transfer error interrupt. */
    HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TE);

    /* Enable the DMA transfer. */
    STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    hxspi->last_error_codes = HAL_XSPI_ERROR_DMA;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
    hxspi->global_state = HAL_XSPI_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief   Receive an amount of data in non-blocking mode with DMA.
  * @param   hxspi  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                 the handle information for the specified XSPI instance.
  * @param   p_data Pointer to data buffer.
  * @note    This function is used only in Indirect Read Mode.
  * @warning If DMA peripheral access is configured as halfword, the number
  *          of data and the FIFO threshold must be aligned on halfword.
  * @warning If DMA peripheral access is configured as word, the number
  *          of data and the FIFO threshold must be aligned on word.
  * @retval  HAL_ERROR         An error has occurred.
  * @retval  HAL_INVALID_PARAM Invalid parameter.
  * @retval  HAL_BUSY          XSPI state is active when calling this API.
  * @retval  HAL_OK            Operation completed.
  */
hal_status_t HAL_XSPI_Receive_DMA(hal_xspi_handle_t *hxspi, void *p_data)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);

