MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  return status;
}

/**
  * @brief  Abort the current transmission (non-blocking function).
  * @param  hxspi     Pointer to a \ref hal_xspi_handle_t structure that contains
  *                   the handle information for the specified XSPI instance.
  * @retval HAL_ERROR An error has occurred.
  * @retval HAL_OK    Operation completed.
  */
hal_status_t HAL_XSPI_Abort_IT(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_STATE(hxspi->global_state,
                   HAL_XSPI_STATE_IDLE | HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE |
                   HAL_XSPI_STATE_CMD_ACTIVE | HAL_XSPI_STATE_AUTO_POLLING_ACTIVE |
                   HAL_XSPI_STATE_TX_ACTIVE | HAL_XSPI_STATE_RX_ACTIVE);

  /* Disable all interrupts. */
  HAL_XSPI_DisableIT(hxspi, (uint32_t)HAL_XSPI_IT_ALL);

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
  if ((XSPI_GET_INSTANCE(hxspi)->CR & XSPI_CR_DMAEN) != 0U)
  {
    /* Disable the DMA transfer on the XSPI side. */
    STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);

    if (hxspi->global_state == HAL_XSPI_STATE_TX_ACTIVE)
    {
      hxspi->global_state = HAL_XSPI_STATE_ABORT;

      /* Disable the DMA transmit on the DMA side. */
      hxspi->hdma_tx->p_xfer_abort_cb = XSPI_DMAAbort;
      (void)HAL_DMA_Abort_IT(hxspi->hdma_tx);
    }
    else if (hxspi->global_state == HAL_XSPI_STATE_RX_ACTIVE)
    {
      hxspi->global_state = HAL_XSPI_STATE_ABORT;

      /* Disable the DMA receive on the DMA side. */
      hxspi->hdma_rx->p_xfer_abort_cb = XSPI_DMAAbort;
      (void)HAL_DMA_Abort_IT(hxspi->hdma_rx);
    }
    else
    {
      return HAL_OK;
    }
  }
  else
#endif /* USE_HAL_XSPI_DMA */
  {
    if (HAL_XSPI_IsActiveFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY) != HAL_XSPI_FLAG_NOT_ACTIVE)
    {
      hxspi->global_state = HAL_XSPI_STATE_ABORT;

      /* Clear transfer complete flag. */
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);

      /* Enable the transfer complete interrupts. */
      HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC);

      /* Perform an abort of the XSPI. */
      STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_ABORT);

      /* Return to indirect mode. */
      STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE);
    }
    else
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup XSPI_Exported_Functions_Group4
  * @{

This subsection provides a set callback functions allowing to manage the data
  transfer from/to external memory
  */

/**
  * @brief  Handle the XSPI interrupt request.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  */
void HAL_XSPI_IRQHandler(hal_xspi_handle_t *hxspi)
{
  volatile uint32_t *p_data_reg = &XSPI_GET_INSTANCE(hxspi)->DR;
  uint32_t it_flag              = XSPI_GET_INSTANCE(hxspi)->SR;
  uint32_t it_source            = XSPI_GET_INSTANCE(hxspi)->CR;
  uint32_t it_active            = it_flag & (it_source >> XSPI_CR_TEIE_Pos);
  uint32_t threshold            = hxspi->fifo_threshold;
  hal_xspi_state_t state        = hxspi->global_state;

  /* XSPI FIFO threshold interrupt occurred --------------------------------------------------------------------------*/
  if ((it_active & (uint32_t)HAL_XSPI_FLAG_FT) != 0U)
  {
    if (state == HAL_XSPI_STATE_RX_ACTIVE)
    {
      while (threshold > 0U)
      {
        *hxspi->p_buffer = *((volatile uint8_t *)p_data_reg);
        hxspi->p_buffer++;
        hxspi->xfer_count--;
        threshold--;
      }
    }

    if (state == HAL_XSPI_STATE_TX_ACTIVE)
    {
      while (threshold > 0U)
      {
        *((volatile uint8_t *)p_data_reg) = *hxspi->p_buffer;
        hxspi->p_buffer++;
        hxspi->xfer_count--;
        threshold--;
      }
    }

    /* All data have been received or transmitted for the transfer */
    if (hxspi->xfer_count == 0U)
    {
      /* Disable the interrupt on the FIFO threshold flag. */
      HAL_XSPI_DisableIT(hxspi, (uint32_t)HAL_XSPI_IT_FT);
    }

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_fifo_threshold_cb(hxspi);
#else
    HAL_XSPI_FifoThresholdCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }

  /* XSPI transfer complete interrupt occurred -----------------------------------------------------------------------*/
  if ((it_active & (uint32_t)HAL_XSPI_FLAG_TC) != 0U)
  {
    /* Clear transfer complete flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);

    /* Disable the interrupts on the FIFO threshold and the transfer complete flags. */
    HAL_XSPI_DisableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC | (uint32_t)HAL_XSPI_IT_FT | (uint32_t)HAL_XSPI_IT_TE);

    if (state == HAL_XSPI_STATE_RX_ACTIVE)
    {
      uint32_t Fifo = STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->SR, XSPI_SR_FLEVEL) >>
                      XSPI_SR_FLEVEL_Pos;
      if ((hxspi->xfer_count > 0U) && (Fifo != 0U))
      {
        while (hxspi->xfer_count != 0U)
        {
          /* Read the last data received in the FIFO. */
          *hxspi->p_buffer = *((volatile uint8_t *)p_data_reg);
          hxspi->p_buffer++;
          hxspi->xfer_count--;
        }
      }
      hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->p_rx_cplt_cb(hxspi);
#else
      HAL_XSPI_RxCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
    }
    else
    {
      if (state == HAL_XSPI_STATE_TX_ACTIVE)
      {
        hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->p_tx_cplt_cb(hxspi);
#else
        HAL_XSPI_TxCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }

