MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
      if (state == HAL_XSPI_STATE_CMD_ACTIVE)
      {
        hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->p_cmd_cplt_cb(hxspi);
#else
        HAL_XSPI_CmdCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }

      if (state == HAL_XSPI_STATE_ABORT)
      {
        hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
        if (hxspi->is_dma_error == 1U)
        {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
          hxspi->last_error_codes |= HAL_XSPI_ERROR_DMA;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

          /* Abort due to an error (eg : DMA error) */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
          hxspi->p_error_cb(hxspi);
#else
          HAL_XSPI_ErrorCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
        }
        else
#endif /* USE_HAL_XSPI_DMA */
        {
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
          hxspi->p_abort_cplt_cb(hxspi);
#else
          HAL_XSPI_AbortCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
        }
      }
    }
  }

#if defined(XSPI_SR_SMF)
  /* XSPI status match interrupt occurred ----------------------------------------------------------------------------*/
  if ((it_active & (uint32_t)HAL_XSPI_FLAG_SM) != 0U)
  {
    /* Clear status match flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_SM);

    /* Check if automatic poll mode stop is activated. */
    if ((XSPI_GET_INSTANCE(hxspi)->CR & XSPI_CR_APMS) != 0U)
    {
      /* Disable the interrupts on the status match and the transfer error flags. */
      HAL_XSPI_DisableIT(hxspi, ((uint32_t)HAL_XSPI_IT_SM | (uint32_t)HAL_XSPI_IT_TE));
      hxspi->global_state = HAL_XSPI_STATE_IDLE;
    }

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_status_match_cb(hxspi);
#else
    HAL_XSPI_StatusMatchCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
#endif /* XSPI_SR_SMF */

  /* XSPI transfer error interrupt occurred --------------------------------------------------------------------------*/
  if ((it_active & (uint32_t)HAL_XSPI_FLAG_TE) != 0U)
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    hxspi->last_error_codes |= HAL_XSPI_ERROR_TRANSFER;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    /* Clear Transfer error flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE);

    /* Disable all interrupts. */
    HAL_XSPI_DisableIT(hxspi, (uint32_t)HAL_XSPI_IT_ALL);

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
    if ((XSPI_GET_INSTANCE(hxspi)->CR & XSPI_CR_DMAEN) != 0U)
    {
      /* Disable the DMA transfer on the XSPI side. */
      STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);

      hxspi->is_dma_error = 1U;

      if (state == HAL_XSPI_STATE_TX_ACTIVE)
      {
        /* Disable the DMA transmit on the DMA side. */
        hxspi->hdma_tx->p_xfer_abort_cb = XSPI_DMAAbortOnError;

        /* Abort the DMA channel. */
        (void)HAL_DMA_Abort_IT(hxspi->hdma_tx);
      }

      if (state == HAL_XSPI_STATE_RX_ACTIVE)
      {
        /* Disable the DMA receive on the DMA side. */
        hxspi->hdma_rx->p_xfer_abort_cb = XSPI_DMAAbortOnError;

        /* Abort the DMA channel. */
        (void)HAL_DMA_Abort_IT(hxspi->hdma_rx);
      }
    }
    else
#endif /* USE_HAL_XSPI_DMA */
    {
      hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->p_error_cb(hxspi);
#else
      HAL_XSPI_ErrorCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
    }
  }

  /* XSPI timeout interrupt occurred ---------------------------------------------------------------------------------*/
  if ((it_active & (uint32_t)HAL_XSPI_FLAG_TO) != 0U)
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    hxspi->last_error_codes |= HAL_XSPI_ERROR_TIMEOUT;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    /* Clear timeout flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TO);

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_error_cb(hxspi);
#else
    HAL_XSPI_ErrorCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
}

/**
  * @brief Error callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_ErrorCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning. */
  STM32_UNUSED(hxspi);
  /* NOTE : This function must not be modified, when the callback is needed,
  the HAL_XSPI_ErrorCallback could be implemented in the user file
  */
}

/**
  * @brief Abort completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_AbortCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning. */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_AbortCpltCallback could be implemented in the user file
  */
}

/**
  * @brief FIFO Threshold callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_FifoThresholdCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE : This function must not be modified, when the callback is needed,
  the HAL_XSPI_FIFOThresholdCallback could be implemented in the user file
  */
}

/**
  * @brief Command completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_CmdCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_CmdCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Rx Transfer completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_RxCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_RxCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Tx Transfer completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_TxCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_TxCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Rx Half Transfer completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_RxHalfCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_RxHalfCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Tx Half Transfer completed callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_TxHalfCpltCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_XSPI_TxHalfCpltCallback could be implemented in the user file
  */
}

#if defined(XSPI_SR_SMF)
/**
  * @brief Status Match callback.
  * @param hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *              the handle information for the specified XSPI instance.
  */
__WEAK void HAL_XSPI_StatusMatchCallback(hal_xspi_handle_t *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hxspi);

  /* NOTE : This function must not be modified, when the callback is needed,
  the HAL_XSPI_StatusMatchCallback could be implemented in the user file
  */
}
#endif /* XSPI_SR_SMF */

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register the XSPI Error Callback to be used instead of
  *         the weak HAL_XSPI_ErrorCallback() predefined callback.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_callback        Specifies the error callback.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_XSPI_RegisterErrorCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

