MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  /* Store the callback function within handle */
  hxspi->p_status_match_cb = p_callback;

  return HAL_OK;
}
#endif /* XSPI_SR_SMF */

/**
  * @brief  Register the XSPI Abort complete Callback TO be used instead of
  *         the weak HAL_XSPI_AbortCpltCallback() predefined callback.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_callback        Specifies the abort complete callback.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_XSPI_RegisterAbortCpltCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t  p_callback)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Store the callback function within handle */
  hxspi->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the XSPI FIFO threshold callback to be used instead of
  *         the weak HAL_XSPI_FifoThresholdCallback() predefined callback.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_callback        Specifies the FIFO threshold complete callback.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_XSPI_RegisterFifoThresholdCallback(hal_xspi_handle_t *hxspi, hal_xspi_cb_t  p_callback)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Store the callback function within handle */
  hxspi->p_fifo_threshold_cb = p_callback;

  return HAL_OK;
}
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

#if defined (USE_HAL_XSPI_USER_DATA) && (USE_HAL_XSPI_USER_DATA == 1U)
/**
  * @brief  Store User Data pointer into the handle.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_XSPI_SetUserData(hal_xspi_handle_t *hxspi, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  hxspi->p_user_data = p_user_data;
}
/**
  * @brief  Retrieve User Data pointer from the handle.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Pointer to the user data.
  */
const void *HAL_XSPI_GetUserData(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  return (hxspi->p_user_data);
}
#endif /* USE_HAL_XSPI_USER_DATA == 1U */

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
/**
  * @brief  link/store Tx HAL DMA handle into the HAL XSPI handle.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  hdma_tx           Pointer to a hal_dma_handle_t.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            The DMA Tx handle has been successfully linked and stored in the XSPI handle.
  */
hal_status_t HAL_XSPI_SetTxDMA(hal_xspi_handle_t *hxspi, hal_dma_handle_t *hdma_tx)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(hdma_tx != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_INIT | HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hdma_tx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hxspi->hdma_tx    = hdma_tx;
  hdma_tx->p_parent = hxspi;

  return HAL_OK;
}

/**
  * @brief  link/store Rx HAL DMA handle into the HAL XSPI handle.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  hdma_rx           Pointer to a hal_dma_handle_t.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            The DMA Rx handle has been successfully linked and stored in the XSPI handle.
  */
hal_status_t HAL_XSPI_SetRxDMA(hal_xspi_handle_t *hxspi, hal_dma_handle_t *hdma_rx)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(hdma_rx != NULL);

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_INIT | HAL_XSPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hdma_rx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hxspi->hdma_rx    = hdma_rx;
  hdma_rx->p_parent = hxspi;

  return HAL_OK;
}
#endif /* USE_HAL_XSPI_DMA */
/**
  * @}
  */

/** @addtogroup XSPI_Exported_Functions_Group5
  * @{

This subsection provides a set of functions allowing to read peripheral
current frequency, state and last occurred errors.
  */

/** @brief  Return the peripheral clock frequency for XSPI.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @retval uint32_t Frequency in Hz.
  * @retval 0 source clock of the hxspi not configured or not ready.
  */
uint32_t HAL_XSPI_GetClockFreq(const hal_xspi_handle_t *hxspi)
{
  /* Check the XSPI handle & config allocation. */
  ASSERT_DBG_PARAM((hxspi != NULL));

  /* Check the global state, the driver must be at least configured. */
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_INIT | HAL_XSPI_STATE_IDLE
                   | HAL_XSPI_STATE_CMD_ACTIVE | HAL_XSPI_STATE_AUTO_POLLING_ACTIVE
                   | HAL_XSPI_STATE_TX_ACTIVE | HAL_XSPI_STATE_RX_ACTIVE
                   | HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE | HAL_XSPI_STATE_ABORT);

  return HAL_RCC_XSPI_GetKernelClkFreq((XSPI_TypeDef *)((uint32_t)(hxspi->instance)));
}

/**
  * @brief  Retrieve the HAL XSPI Global State.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @return Retrieve the XSPI global state.
  */
hal_xspi_state_t HAL_XSPI_GetState(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

