MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  return hxspi->global_state;
}

#if defined (USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
/**
  * @brief  Return the XSPI error code.
  * @param  hxspi Pointer to a \ref hal_xspi_handle_t structure that contains
  *               the handle information for the specified XSPI instance.
  * @retval XSPI error code
  */
uint32_t HAL_XSPI_GetLastErrorCodes(const hal_xspi_handle_t *hxspi)
{
  return hxspi->last_error_codes;
}
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
/**
  * @}
  */

/** @addtogroup XSPI_Exported_Functions_Group6
  * @{

This subsection provides a set of functions allowing to configure the Delay Block :

- Call the function HAL_XSPI_DLYB_SetConfigDelay() to set the delay configuration of the delay block peripheral
- Call the function HAL_XSPI_DLYB_GetConfigDelay() to get the delay output clock phase of the delay block peripheral
- Call the function HAL_XSPI_DLYB_CalculateMaxClockPhase() to calculate the maximum output clock phase of the
  delay block peripheral
- Call the function HAL_XSPI_DLYB_Enable() to enable the delay block peripheral
- Call the function HAL_XSPI_DLYB_Disable() to disable the delay block peripheral
- Call the function HAL_XSPI_DLYB_IsEnabled() to check if the delay block peripheral is enabled or not
  */

/**
  * @brief  Set the delay configuration of the delay block peripheral.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  clock_phase_value The desired output clock phase value.
  * @retval HAL_INVALID_PARAM When no valid XSPI.
  * @retval HAL_OK            The delay is correctly configured.
  */
hal_status_t HAL_XSPI_DLYB_SetConfigDelay(hal_xspi_handle_t *hxspi, uint32_t clock_phase_value)
{
  hal_status_t status = HAL_ERROR;
  DLYB_TypeDef *dlyb_instance;
  dlyb_state_t state;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)));
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)) == 0U)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  dlyb_instance = XSPI_DLYB_GET_INSTANCE(hxspi->instance);

  state = DLYB_IsEnabled(dlyb_instance);
  DLYB_Enable(dlyb_instance);

  /* Enable XSPI Free Running Clock (mandatory). */
  STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  if (DLYB_ConfigureUnitDelay(dlyb_instance) == DLYB_CORE_OK)
  {
    DLYB_SetOutputClockPhase(dlyb_instance, clock_phase_value);
    status = HAL_OK;
  }

  (void)XSPI_Abort(hxspi, XSPI_TIMEOUT_DEFAULT_VALUE);

  /* Disable Free Running Clock. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  if (state == DLYB_DISABLED)
  {
    DLYB_Disable(dlyb_instance);
  }

  return status;
}

/**
  * @brief  Get the delay output clock phase of the delay block peripheral.
  * @param  hxspi              Pointer to a \ref hal_xspi_handle_t structure that contains
  *                            the handle information for the specified XSPI instance.
  * @param  p_clock_phase      Pointer to the variable where the selected output clock phase value will be stored.
  * @retval HAL_INVALID_PARAM When no valid XSPI.
  * @retval HAL_OK            When the register reading was successful.
  */
hal_status_t HAL_XSPI_DLYB_GetConfigDelay(const hal_xspi_handle_t *hxspi, uint32_t *p_clock_phase)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)));
  ASSERT_DBG_PARAM(p_clock_phase != NULL);
  ASSERT_DBG_STATE(hxspi->global_state,
                   HAL_XSPI_STATE_IDLE | HAL_XSPI_STATE_CMD_ACTIVE
                   | HAL_XSPI_STATE_AUTO_POLLING_ACTIVE | HAL_XSPI_STATE_TX_ACTIVE
                   | HAL_XSPI_STATE_RX_ACTIVE | HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE
                   | HAL_XSPI_STATE_ABORT);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)) == 0U) || (p_clock_phase == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  *p_clock_phase = DLYB_GetOutputClockPhase(XSPI_DLYB_GET_INSTANCE(hxspi->instance));

  return HAL_OK;
}

/**
  * @brief  Calculate maximum output clock phase of the delay block peripheral.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @param  p_max_clock_phase Pointer to the variable where the maximum clock phase value will be stored.
  * @retval HAL_ERROR         The max clock phase is not correctly calculated.
  * @retval HAL_INVALID_PARAM When no valid XSPI or invalid p_max_clock_phase parameter.
  * @retval HAL_OK            The max clock phase is correctly calculated.
 */
hal_status_t HAL_XSPI_DLYB_CalculateMaxClockPhase(hal_xspi_handle_t *hxspi, uint32_t *p_max_clock_phase)
{
  hal_status_t status = HAL_ERROR;
  DLYB_TypeDef *dlyb_instance;
  uint32_t sel;
  uint32_t unit;
  dlyb_state_t state;

  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)));
  ASSERT_DBG_PARAM(p_max_clock_phase != NULL);
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)) == 0U) || (p_max_clock_phase == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  dlyb_instance = XSPI_DLYB_GET_INSTANCE(hxspi->instance);

  state = DLYB_IsEnabled(dlyb_instance);
  DLYB_Enable(dlyb_instance);

  /* Enable XSPI Free Running Clock (mandatory). */
  STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  DLYB_GetConfig(dlyb_instance, &unit, &sel);

  if (DLYB_ConfigureUnitDelay(dlyb_instance) == DLYB_CORE_OK)
  {
    *p_max_clock_phase = DLYB_CalculateMaxOutputClockPhase(dlyb_instance);
    status = HAL_OK;
  }

  DLYB_SetConfig(dlyb_instance, unit, sel);

