MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
  /* Disable XSPI Free Running Clock. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->DCR1, XSPI_DCR1_FRCK);

  if (state == DLYB_DISABLED)
  {
    DLYB_Disable(dlyb_instance);
  }

  return status;
}

/**
  * @brief  Enable the delay block peripheral.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @retval HAL_ERROR         The delay is not correctly configured.
  * @retval HAL_INVALID_PARAM When no valid XSPI instance.
  * @retval HAL_OK            The delay is correctly configured.
  */
hal_status_t HAL_XSPI_DLYB_Enable(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  ASSERT_DBG_PARAM(IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)));
  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)) == 0U)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DLYB_Enable(XSPI_DLYB_GET_INSTANCE(hxspi->instance));

  return HAL_OK;
}

/**
  * @brief  Disable the delay block peripheral.
  * @param  hxspi             Pointer to a \ref hal_xspi_handle_t structure that contains
  *                           the handle information for the specified XSPI instance.
  * @retval HAL_INVALID_PARAM When no valid XSPI instance.
  * @retval HAL_OK            The delay block is disabled.
  */
hal_status_t HAL_XSPI_DLYB_Disable(hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);
  ASSERT_DBG_PARAM(IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)));

  ASSERT_DBG_STATE(hxspi->global_state, HAL_XSPI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (IS_XSPI_DLYB_INSTANCE(XSPI_GET_INSTANCE(hxspi)) == 0U)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DLYB_Disable(XSPI_DLYB_GET_INSTANCE(hxspi->instance));

  return HAL_OK;
}

/**
  * @brief  Check if the delay block peripheral is enabled or not.
  * @param  hxspi                  Pointer to a \ref hal_xspi_handle_t structure that contains
  *                                the handle information for the specified XSPI instance.
  * @retval HAL_XSPI_DLYB_ENABLED  The delay block is enabled.
  * @retval HAL_XSPI_DLYB_DISABLED The delay block is disabled.
  */
hal_xspi_dlyb_status_t HAL_XSPI_DLYB_IsEnabled(const hal_xspi_handle_t *hxspi)
{
  ASSERT_DBG_PARAM(hxspi != NULL);

  return (hal_xspi_dlyb_status_t)DLYB_IsEnabled(XSPI_DLYB_GET_INSTANCE(hxspi->instance));
}
/**
  * @}
  */


/**
  * @}
  */

/** @addtogroup XSPI_Private_Functions XSPI Private Functions
  * @{
  */

/**
  * @brief  Wait for a flag state until timeout in non-blocking mode.
  * @param  hxspi      Pointer to a \ref hal_xspi_handle_t structure that contains
  *                    the handle information for the specified XSPI instance.
  * @param  flag       Flag checked.
  * @param  state      Value of the flag expected.
  * @param  timeout_ms Timeout duration.
  * @retval HAL_ERROR  An error has occurred.
  * @retval HAL_OK     Flag is correctly set.
  */
static hal_status_t XSPI_WaitFlagStateUntilTimeout(hal_xspi_handle_t *hxspi,
                                                   uint32_t flag,
                                                   hal_xspi_flag_status_t state,
                                                   uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_XSPI_IsActiveFlag(hxspi, flag) != state)
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (HAL_XSPI_IsActiveFlag(hxspi, flag) != state)
      {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
        if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
        {
          hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
        }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
/**
  * @brief DMA XSPI process complete callback.
  * @param hdma Pointer to DMA handle.
  */
static void XSPI_DMACplt(hal_dma_handle_t *hdma)
{
  hal_xspi_handle_t *hxspi = (hal_xspi_handle_t *)(hdma->p_parent);
  hxspi->xfer_count = 0U;

  /* Disable the DMA transfer on the XSPI side. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);

  LL_DMA_DisableChannel((DMA_Channel_TypeDef *)((uint32_t)hdma->instance));

  /* Enable the XSPI transfer complete interrupt. */
  HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC);
}

/**
  * @brief DMA XSPI process half complete callback.
  * @param hdma Pointer to DMA handle.
  */
static void XSPI_DMAHalfCplt(hal_dma_handle_t *hdma)
{
  hal_xspi_handle_t *hxspi = (hal_xspi_handle_t *)(hdma->p_parent);
  hxspi->xfer_count = (hxspi->xfer_count >> 1U);

  if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE) == XSPI_FUNCTIONAL_MODE_INDIRECT_READ)
  {
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_rx_half_cplt_cb(hxspi);
#else
    HAL_XSPI_RxHalfCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
  else
  {
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_tx_half_cplt_cb(hxspi);
#else
    HAL_XSPI_TxHalfCpltCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
}

/**
  * @brief DMA XSPI communication error callback.
  * @param hdma Pointer to DMA handle.
  */
static void XSPI_DMAError(hal_dma_handle_t *hdma)
{
  hal_xspi_handle_t *hxspi = (hal_xspi_handle_t *)(hdma->p_parent);
  hxspi->xfer_count = 0U;

  /* Disable the DMA transfer on the XSPI side. */
  STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);

  /* Abort the XSPI. */
  if (HAL_XSPI_Abort_IT(hxspi) != HAL_OK)
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    hxspi->last_error_codes |= HAL_XSPI_ERROR_DMA;
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    HAL_XSPI_DisableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC | (uint32_t)HAL_XSPI_IT_FT | (uint32_t)HAL_XSPI_IT_TE);

    hxspi->global_state = HAL_XSPI_STATE_IDLE;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->p_error_cb(hxspi);
#else
    HAL_XSPI_ErrorCallback(hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
}

/**
  * @brief DMA XSPI abort complete callback.
  * @param hdma Pointer to DMA handle.
  */
static void XSPI_DMAAbortOnError(hal_dma_handle_t *hdma)
{
  hal_xspi_handle_t *hxspi = (hal_xspi_handle_t *)(hdma->p_parent);
  hxspi->xfer_count = 0U;

  /* DMA abort called by XSPI abort. */
  if (HAL_XSPI_IsActiveFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY) != HAL_XSPI_FLAG_NOT_ACTIVE)
  {
    /* Clear transfer complete flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);

    /* Enable the transfer complete interrupts. */
    HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC);

    /* Perform an abort of the XSPI. */
    STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_ABORT);
  }
  else
  {
    return;
  }
}

/**
  * @brief DMA XSPI abort complete callback.
  * @param hdma Pointer to DMA handle.
  */
static void XSPI_DMAAbort(hal_dma_handle_t *hdma)
{
  hal_xspi_handle_t *hxspi = (hal_xspi_handle_t *)(hdma->p_parent);
  hxspi->xfer_count = 0U;

  /* DMA abort called by XSPI abort. */
  if (HAL_XSPI_IsActiveFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY) != HAL_XSPI_FLAG_NOT_ACTIVE)
  {
    /* Clear transfer complete flag. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);

    /* Enable the interrupt on the transfer complete flag. */
    HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC);

    /* Perform an abort of the XSPI. */
    STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_ABORT);
  }
  else
  {
    return;
  }
}
#endif /* USE_HAL_XSPI_DMA */

/**
  * @brief  Set the Regular command configuration.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  p_cmd       Structure that contains the Regular command configuration information.
  * @param  timeout_ms  Timeout duration.
  * @param  it_state    interrupt state.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t XSPI_SendRegularCmd(hal_xspi_handle_t *hxspi,
                                        const hal_xspi_regular_cmd_t *p_cmd,
                                        uint32_t timeout_ms,
                                        hal_xspi_interrupt_state_t it_state)
{
  hal_status_t status = HAL_OK;
  volatile uint32_t *p_ccr_reg;
  volatile uint32_t *p_tcr_reg;
  volatile uint32_t *p_ir_reg;
  volatile uint32_t *p_abr_reg;

  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     timeout_ms) == HAL_OK)
  {
    /* Clear transfer error and transfer complete flags. */
    HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_TC);

    /* Set functional mode. */
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, 0U);

    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_IO_SELECT_MSK, (uint32_t)p_cmd->io_select);

    p_ccr_reg = (volatile uint32_t *)((uint32_t)(&(XSPI_GET_INSTANCE(hxspi)->CCR)) + (uint32_t)p_cmd->operation_type);
    p_tcr_reg = (volatile uint32_t *)((uint32_t)(&(XSPI_GET_INSTANCE(hxspi)->TCR)) + (uint32_t)p_cmd->operation_type);
    p_ir_reg  = (volatile uint32_t *)((uint32_t)(&(XSPI_GET_INSTANCE(hxspi)->IR)) + (uint32_t)p_cmd->operation_type);
    p_abr_reg = (volatile uint32_t *)((uint32_t)(&(XSPI_GET_INSTANCE(hxspi)->ABR)) + (uint32_t)p_cmd->operation_type);

    /* Configure DQS modes. */
    *p_ccr_reg = (uint32_t)p_cmd->dqs_mode_status | (uint32_t)p_cmd->alternate_bytes_mode |
                 (uint32_t)p_cmd->alternate_bytes_dtr_mode_status | (uint32_t)p_cmd->alternate_bytes_width |
                 (uint32_t)p_cmd->instruction_mode | (uint32_t)p_cmd->instruction_dtr_mode_status
                 | (uint32_t)p_cmd->instruction_width |
                 (uint32_t)p_cmd->addr_mode | (uint32_t)p_cmd->addr_dtr_mode_status | (uint32_t)p_cmd->addr_width  |
                 (uint32_t)p_cmd->data_mode | (uint32_t)p_cmd->data_dtr_mode_status;

    /* Configure alternate bytes. */
    *p_abr_reg = p_cmd->alternate_bytes;

    /* Configure the number of dummy cycles. */
    STM32_MODIFY_REG((*p_tcr_reg), XSPI_TCR_DCYC, p_cmd->dummy_cycle);

