MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
    /* Configure the number of data. */
    XSPI_GET_INSTANCE(hxspi)->DLR = (p_cmd->size_byte - 1U);

    /* Configure the instruction value. */
    *p_ir_reg = p_cmd->instruction;

    /* Configure the address value. */
    XSPI_GET_INSTANCE(hxspi)->AR = p_cmd->addr;

    if (it_state == XSPI_INTERRUPT_DISABLE)
    {
      if (p_cmd->data_mode == HAL_XSPI_REGULAR_DATA_NONE)
      {
        /* When there is no data phase, the transfer starts as soon as the configuration is done.
        Wait until TC flag is set to go back in idle state. */
        if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                           timeout_ms) == HAL_OK)
        {
          HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);
        }
        else
        {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
          if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
          {
            hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
          }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

          status = HAL_TIMEOUT;
        }
      }
    }
    else
    {
      /* Enable the interrupts on transfer complete and transfer error flags. */
      HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_TC | (uint32_t)HAL_XSPI_IT_TE);
    }
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
    {
      hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
    }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    status = HAL_TIMEOUT;
  }

  return status;
}

#if defined(XSPI_SR_SMF)
/**
  * @brief  Configure the XSPI Automatic Polling Mode for Regular protocol.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  p_config    Pointer to structure that contains the polling configuration information.
  * @param  timeout_ms  Timeout duration.
  * @param  it_state    Interrupt state.
  * @retval HAL_ERROR   An error has occurred.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_BUSY    XSPI state is active when calling this API.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi,
                                             const hal_xspi_auto_polling_config_t *p_config,
                                             uint32_t timeout_ms,
                                             hal_xspi_interrupt_state_t it_state)
{
  uint32_t addr_reg = XSPI_GET_INSTANCE(hxspi)->AR;
  uint32_t ir_reg = XSPI_GET_INSTANCE(hxspi)->IR;

  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     timeout_ms) == HAL_OK)
  {
    /* Set the following configurations :
    - match mask
    - match value
    - match mode
    - interval cycle
    - automatic stop */
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->PSMKR, p_config->match_mask);
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->PSMAR, p_config->match_value);
    STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->PIR,   p_config->interval_cycle);
    STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, (XSPI_CR_PMM | XSPI_CR_APMS | XSPI_CR_FMODE),
                     ((uint32_t)p_config->match_mode | (uint32_t)p_config->automatic_stop_status |
                      XSPI_FUNCTIONAL_MODE_AUTO_POLLING));

    if (it_state != XSPI_INTERRUPT_DISABLE)
    {
      /* Clear transfer error and status match flags. */
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TE | (uint32_t)HAL_XSPI_FLAG_SM);

      /* Enable the interrupts on the status match and transfer error flags. */
      HAL_XSPI_EnableIT(hxspi, (uint32_t)HAL_XSPI_IT_SM | (uint32_t)HAL_XSPI_IT_TE);
    }

    /* Trig the transfer by re-writing address or instruction register. */
    if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
    }
    else
    {
      STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
    }

    if (it_state == XSPI_INTERRUPT_DISABLE)
    {
      /* Wait till status match flag is set to go back in idle state. */
      if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_SM, HAL_XSPI_FLAG_ACTIVE,
                                         timeout_ms) == HAL_OK)
      {
        /* Clear status match flag. */
        HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_SM);
      }
      else
      {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
        if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
        {
          hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
        }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

        return HAL_TIMEOUT;
      }
    }
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
    {
      hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
    }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

    return HAL_TIMEOUT;
  }

  return HAL_OK;
}
#else
/**
  * @brief  Configure the XSPI Automatic Polling Mode for Regular protocol.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  p_config    Pointer to structure that contains the polling configuration information.
  * @param  timeout_ms  Timeout duration.
  * @retval HAL_ERROR   An error has occurred.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_BUSY    XSPI state is active when calling this API.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t XSPI_ExecRegularAutoPoll(hal_xspi_handle_t *hxspi,
                                             const hal_xspi_auto_polling_config_t *p_config,
                                             uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;
  uint32_t addr_reg = XSPI_GET_INSTANCE(hxspi)->AR;
  uint32_t ir_reg = XSPI_GET_INSTANCE(hxspi)->IR;
  volatile uint32_t *p_data_reg = &XSPI_GET_INSTANCE(hxspi)->DR;
  uint32_t buffer = ~(p_config->match_value);

  /* Wait till busy flag is reset. */
  if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                     timeout_ms) == HAL_OK)
  {
    /* Wait till status match flag is set to go back in idle state. */
    while ((buffer & p_config->match_mask) != (p_config->match_value & p_config->match_mask))
    {
      /* Configure counters and size. */
      hxspi->xfer_count = STM32_READ_REG(XSPI_GET_INSTANCE(hxspi)->DLR) + 1U;
      hxspi->xfer_size  = hxspi->xfer_count;
      hxspi->p_buffer   = (uint8_t *)&buffer;

      /* Configure the functional mode as indirect read. */
      STM32_MODIFY_REG(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

      /* Trig the transfer by re-writing address or instruction register. */
      if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CCR, XSPI_CCR_ADMODE) != (uint32_t)HAL_XSPI_ADDR_NONE)
      {
        STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->AR, addr_reg);
      }
      else
      {
        STM32_WRITE_REG(XSPI_GET_INSTANCE(hxspi)->IR, ir_reg);
      }

      do
      {
        /* Wait till fifo threshold or transfer complete flags are set to read received data. */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_FT | (uint32_t)HAL_XSPI_FLAG_TC,
                                                HAL_XSPI_FLAG_ACTIVE,  timeout_ms);
        if (status != HAL_OK)
        {
          break;
        }

        *hxspi->p_buffer = *((volatile uint8_t *)p_data_reg);
        hxspi->p_buffer++;
        hxspi->xfer_count--;

      } while (hxspi->xfer_count > 0U);

      if (status == HAL_OK)
      {
        /* Wait till transfer complete flag is set to go back in idle state. */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_TC, HAL_XSPI_FLAG_ACTIVE,
                                                timeout_ms);

        if (status == HAL_OK)
        {
          HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);
        }
      }

      HAL_Delay(p_config->interval_cycle);
    };
  }
  else
  {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
    if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
    {
      hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
    }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

