MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_xspi.c
    return HAL_TIMEOUT;
  }

  return HAL_OK;
}
#endif /* XSPI_SR_SMF */

/**
  * @brief  Abort the current transmission.
  * @param  hxspi       Pointer to a \ref hal_xspi_handle_t structure that contains
  *                     the handle information for the specified XSPI instance.
  * @param  timeout_ms  Timeout duration.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t XSPI_Abort(hal_xspi_handle_t *hxspi, uint32_t timeout_ms)
{
#if defined(USE_HAL_XSPI_DMA) && (USE_HAL_XSPI_DMA == 1U)
  if ((XSPI_GET_INSTANCE(hxspi)->CR & XSPI_CR_DMAEN) != 0U)
  {
    /* Disable the DMA transfer on the XSPI side. */
    STM32_CLEAR_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_DMAEN);

    if (STM32_READ_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_FMODE) == XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE)
    {
      /* Disable the DMA transmit on the DMA side. */
      if (HAL_DMA_Abort(hxspi->hdma_tx) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
    else
    {
      /* Disable the DMA receive on the DMA side. */
      if (HAL_DMA_Abort(hxspi->hdma_rx) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
  }
#endif /* USE_HAL_XSPI_DMA */

  if (HAL_XSPI_IsActiveFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY) != HAL_XSPI_FLAG_NOT_ACTIVE)
  {
    /* Perform an abort of the XSPI. */
    STM32_SET_BIT(XSPI_GET_INSTANCE(hxspi)->CR, XSPI_CR_ABORT);

    /* Wait until the transfer complete flag is set to go back in idle state. */
    if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_TC, HAL_XSPI_FLAG_ACTIVE,
                                       timeout_ms) == HAL_OK)
    {
      /* Clear transfer complete flag. */
      HAL_XSPI_ClearFlag(hxspi, (uint32_t)HAL_XSPI_FLAG_TC);

      /* Wait until the busy flag is reset to go back in idle state. */
      if (XSPI_WaitFlagStateUntilTimeout(hxspi, (uint32_t)HAL_XSPI_FLAG_BUSY, HAL_XSPI_FLAG_NOT_ACTIVE,
                                         timeout_ms) != HAL_OK)
      {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
        if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
        {
          hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
        }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */

        return HAL_TIMEOUT;
      }
    }
    else
    {
#if defined(USE_HAL_XSPI_GET_LAST_ERRORS) && (USE_HAL_XSPI_GET_LAST_ERRORS == 1U)
      if (HAL_XSPI_IsActiveFlag(hxspi, HAL_XSPI_FLAG_TE) != HAL_XSPI_FLAG_NOT_ACTIVE)
      {
        hxspi->last_error_codes = HAL_XSPI_ERROR_TRANSFER;
      }
#endif /* USE_HAL_XSPI_GET_LAST_ERRORS */
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @}
  */

#endif /* USE_HAL_XSPI_MODULE */

#endif /* XSPI1 */
/**
  * @}
  */

/**
  * @}
  */
